[{"label":"science","text":"how many types of stars are there in universe? this question belongs to celestial navigation in merchant navy"},{"label":"other","text":"how do you do the problem x^2-x(square root of 5)= 0..help!? our teacher never teaches us anything!"},{"label":"entertainment","text":"Do you like playing the guessing game? "},{"label":"science","text":"fill in the blank  1. 3sq yd=sq ft   2. 3cm=mm   3. 1200g=kg? "},{"label":"sport","text":"tottenham were crap today.it had to end.but the spurs will be back keep the faith? "},{"label":"entertainment","text":"whats a good site to buy Alcatraz memorabilia? "},{"label":"sport","text":"How long is the run up to the Long Jump? "},{"label":"entertainment","text":"What is ur favorite song and what r the lyrics to it? "},{"label":"entertainment","text":"Who is Fab-5- Freddy? if Blondie really created rap,....lol (that's what some ignorant white people told me) then why did she say, \"\"Fab 5 Freddy told me everybody's fly.  deejay spins and i say my-my.?\"\"  on her song Rapture?"},{"label":"sport","text":"american indoor football league schedule? looking for the schedule for the Gladiators"},{"label":"science","text":"what is transposon?can u give me the mechanism of replication in flash? "},{"label":"other","text":"i want to buy a phone without creditcard but with bank account? "},{"label":"science","text":"What are 4 ways Plant Cellls Are Different from Animal Cellls? "},{"label":"entertainment","text":"what is the point in going to mspace i went once and i dont get it what do you on there? "},{"label":"other","text":"Is drug testing at work a good thing? Or, is it unconstitutional? "},{"label":"entertainment","text":"has any one seen the movie \"\"derailed\"\"? that was a crazy movie! i guessed the end though before it happened somethng just told me that is the way it was goin down!!"},{"label":"other","text":"what has been done to prevent deforestation? "},{"label":"sport","text":"Should Bill Cowher get Fired? "},{"label":"science","text":"who is ian stevenson and what does he have to do with rebirth? I want to know about Rebirth and reincarnation and if they are true with some real case histories."},{"label":"entertainment","text":"Anyone else think Davinci Code was the worst casted movie of all time? "},{"label":"other","text":"Angelina or Jennifer? "},{"label":"other","text":"I heard this Yahoo Q&A thing is Scientology in disguise; that at Level 2 they send you a copy of\"\"Dianetics\"\"... Anyone?"},{"label":"sport","text":"Who should i start this week Bulger or Rivers? Bulger has been suckn it up lately and the rams offensive line is hurting, but Rivers is at Denver this week so thats no walk in the park.  what do ya'll think?"},{"label":"science","text":"what is the number of electrons in kryton? "},{"label":"other","text":"What's the worst that can happen? Back in August I was pulled over for speeding 43 in a 35 mph zone.  The problem is I don't have a license and I don't drive.  I am taking a lot of medications under a doctors care, and I don't remember why I went out or why.  So now I have to go to court for the speeding, no license and no insurance.  Any clue what's the worst that could happen?"},{"label":"other","text":"Let's try this again... America & freeing other countries!? Okay. So my questions seems to have died early & since people dont check back to see extra comments Im asking again. First though, please don't give me BS about the war in Iraq, that is not the issue. I support our troops so lets try to look beyond that fact at the question at hand.\\n\\nWhy does the American government fight to free other countries?\\n\\nIsn't it ironic the Civil War was not over slavery but over the South wanting freedom? Yet, we're fighting wars to free other countries from unfair gov'ts.\\nThe US fought its bloodiest war b\/c it was unwilling to allow the South to be free of a gov't which was hindering it with tariffs.\\nNot only did we start a war over the same issues we sought to free ourselves from in the Revolutionary War, but in turn, the gov't changed the focus to slavery. Its against the law for any state to suceed from the US.\\nIsn't that hypocracy?\\nHow can we say we get the right to free other countries when we have denied freedom to our own people?"},{"label":"other","text":"Who made up the Eglish Alphabet and made the gramatical rules? Also the spelling of words...like, why do we have c and k they sound the same and in some words c and s sound the same why use two different letters for the same sound?"},{"label":"sport","text":"What happens when the Buckeyes fill their helmets with stickers? Do they get a new helmet?  Or do they overlap the others?  Because what is the qualification for a good play?  Just wanted to know because some plays are good and some are great."},{"label":"sport","text":"I am going to start to skateboard what is the best deck, bearings.......? What is the best deck, bearings so on so on. I am a begginger. Also what addvice do you have to me."},{"label":"sport","text":"What is the point of the SPL split... Why not 16 team league playing eachother twice?? "},{"label":"science","text":"what are the answers to these division problems?show how you did it? 12 divided by 914\\n64 divided by 532"},{"label":"entertainment","text":"Do your Kids believe in Santa Clause? and Whens the BEST time to Crush their Little dreams? \\n\\nmmwwwhhhaaahhahhaaaahhaaaaaa :-)"},{"label":"science","text":"Set up the equations for the following problems and solve? for three consecutive intergers, when four times the third is subtracted from five times the first, ther result is -4.  Find the integers\\n\\nshow working please"},{"label":"sport","text":"Where can get a parts catalog for a 1971 to75 chrysler 105hp Out board motor? Any help will be greatly appreciated; Thank you..\\n                                             Reason"},{"label":"sport","text":"NBA Overtime!? What percentage of NBA games end in overtime?\\nWhat Percentage of NBA championships end in overtime?\\n\\nWARNING!!  Abusers (no answer) will be reported!!"},{"label":"science","text":"solve :  x^(x+1)+x^(2x)=2? "},{"label":"sport","text":"what is a Lindy rig? "},{"label":"sport","text":"what country that celebrated the first fifa world cup? Hint: the country that celebrated the first fifa world cup is near south-Amercia so i think you would know"},{"label":"science","text":"why is the sky blue? "},{"label":"entertainment","text":"Do you know the band Black Prophecy? "},{"label":"entertainment","text":"has anyone read 'hearts in atlantis' ?  what is it about? "},{"label":"entertainment","text":"Would you date someone who smokes? "},{"label":"other","text":"What adaptations help Koala survive? "},{"label":"entertainment","text":"Does he look like a Bi@#h? DESCRIBE WHAT MARSELLUS WALLACE LOOKS LIKE!!!"},{"label":"sport","text":"i have a arsenal t shirt sign 1986 with all paper work were can i sale it for good money? "},{"label":"sport","text":"do the poms have any chance at winning the ashes down under? they were lucky last time round but can they back it up in oz"},{"label":"entertainment","text":"Piano players? Which song do you like best Greensleeves or Fur Elise?\\n\\nI like Fur Elise better because it sounds so good. And I like Greensleeves because it is easy to play."},{"label":"sport","text":"How can i get rid of leg cramps and aches from running(a soulution that would have results over night)?? i run track and after i run a race my legs are exausted for days, this is bad beacuase i always have track the NEXT DAY. Therefore the races i run the next day arent as good as they should be. Do you have some solution that could ease the stiffness and aches in my legs???"},{"label":"entertainment","text":"Who wants to be in my band? It will be kind of folky and cool. I'm going to sing and play something with strings, but there's room for collaborators of all kinds. Detail why you should be in my band please."},{"label":"entertainment","text":"How can I download ringing tones from Vmobile to my phone? I want to get additional ringing tones in my set from vmobile no matter the price if at all it is charged.Then tell me how to do it."},{"label":"entertainment","text":"what was the name of the programme with the dinosaurs where the opening line was always, \"\"Honey, I'm Home!\"\"? "},{"label":"science","text":"morethan inifinty? Consider a hotel that has an infinite number of rooms. Each room contains a person and hence the hotel is full since all rooms and all people stretch to infinity.\\n\\nNow a coach turns up with 10 more people looking for rooms. How does the hotel manager fit the ten new people into his hotel?"},{"label":"entertainment","text":"Metallic \"\"One\"\"\/Johnny Got His Gun question? If anyone has seen the music video One by Metallica, what does the last part where it goes \"\"keep the home fires burning\"\" mean."},{"label":"entertainment","text":"anybody know the title of the song used in the vodafone advert? "},{"label":"sport","text":"Do you think that OSU is going the whole nine yards to win the BCS championship? "},{"label":"entertainment","text":"Does anybody know what happend to Heavy D? What about the Fat Boys? "},{"label":"other","text":"if i become a satanist and my whole family is religious would that be wrong?? "},{"label":"science","text":"How can you tell if a network can be traced over without lifting your pencil? "},{"label":"sport","text":"Is Ryan howard mvp Caliber? i think he si"},{"label":"entertainment","text":"who wrote this song, NOT SANG IT? I Can't Unlove You...Kenny Rogers"},{"label":"other","text":"why can't i open a HTML attachment? I just see a red x in a box? "},{"label":"science","text":"How do docters Diagnose Jacob's Syndrome? "},{"label":"other","text":"why l eat so much bananas? "},{"label":"other","text":"Im looking for a prehistoric sea creature.? It is eel like and Is silver (possibly with black tiger-ish stripes) and I am sure it had a red fin on its back. Im not sure if it had any. I remember reading an article somewhere that one was found a few years ago, still alive. I believe it may have been somewhere near mexico, but I do not know the exact location. If you have any suggestions or websites that could help me I would be very greatful."},{"label":"sport","text":"is yahoo fantasy football free? "},{"label":"entertainment","text":"My old man's a dustbin, he wears a dustbin lid.  Have I got my lyrics wrong here? "},{"label":"other","text":"with an add on card ATM system wat would happen if both the persons withdraw money from diff places simultaneo i've an account for which i and my father hold ATM cards. Now i'm at Delhi n my dad at Pune and the balnce in the account is Rs.10000. Both of us r trying to withdraw money from the account at 9:00 in the morning exactly. Another problem is i'm tryin to withdraw Rs.8000 and my dad an amount of Rs.5000 which exceeds the balance of Rs.10000. So, wat would happen in such a situation and how could we technically term it???"},{"label":"science","text":"if someone likes 400 but not 300100,but not 99, and 3600 but not 3700. does he like 900, 1000, 1100, or 1200? help!!!!!"},{"label":"sport","text":"Question (quiz 2)? What year is Germany last time was be \"\"home\"\"  of FIFA world cup?\\n\\na) 1990 yrs.  write code 096 22 00 00\\nb) 1998 yrs.  write code 096 22 00 01\\nc) 2002 yrs.  write code 096 22 00 02"},{"label":"sport","text":"sould i do it or should i not?? ok i want to try out for cheerleading next year but i can not do back handsprings, any tips on how i can get fexible enough to be able to make the team??"},{"label":"other","text":"can your pay check be garnished for an unsecured loan in the state of NM and for how much? "},{"label":"entertainment","text":"What does the B in B5 stand for? My friends claim they know. They say it's Boys 5 but i think it's Breeding 5. Are they right?"},{"label":"entertainment","text":"Is Julia Roberts' doing a movie for next year? "},{"label":"entertainment","text":"is there a movie called resurrection where near death experience (NDE) or something about spirit is shown? "},{"label":"other","text":"US want middle east more democracy but after the election the winners are against US wat is the reason of this "},{"label":"sport","text":"What time does the peach bowl start? "},{"label":"science","text":"does anyone know a rule for a number wall? KS3 year 7 work."},{"label":"sport","text":"Is Shaquille O'neal irish?I've never heard of a black irish but his last name is irish.? "},{"label":"sport","text":"Will the Lakers lose in the first round of the playoffs? "},{"label":"other","text":"the functional contribution of religion to society using nigeria as an example? "},{"label":"sport","text":"how  much  are  out  of  state fishing  lic for  ark  for  3  days? i  am  from  la  want  to  go  fishing  in  arkansas trying  to  find  out  how  much  lic  are  for  3  day  permit out  of  state"},{"label":"other","text":"Has anyone noticed that most the top leader board people do not argue politics? Is that why they seem wiser? "},{"label":"entertainment","text":"does any body watch super group? on vh1"},{"label":"other","text":"how often do you have sex? "},{"label":"sport","text":"when free climbers climb on a large rock without a rope, how do they get down? I suppose it's much harder to climb down than up, and if  there is no easy way down how can they get down? does a helicopter come an picks them up?"},{"label":"entertainment","text":"so what do you think about tom cruis and katie breaking up? "},{"label":"entertainment","text":"How did I get Out? I was in a room with 4 walls a floor and a roof. There were no windows and no doors. All that was in the room was a table and a chainsaw. How did I get out?\\n\\nHINT: I didn't cut through the walls, floor, or roof.\\n\\nBut then you have to wonder how I got in the room in the first place."},{"label":"entertainment","text":"Who wants to see a sequel to '9 to 5'? I saw it again on TV the other day and had forgotten how funny it is.\\n\\nIt occurs to me that it might be time to introduce this kind of movie again because of immigration conflict and outsourcing of jobs..."},{"label":"entertainment","text":"Can anyone recommend a good place online to buy out-of-print DVDs? Hey! I am looking to buy an out-of-print DVD for one of my favorite movies \"\"The 60's\"\". Does anyone know a good place to find out-of-print dvds on the internet? Tried ebay, amazon is a little on the expensive side... any ideas?"},{"label":"entertainment","text":"do u noe tis race? clues are given in the description below.\\n\\nthis race involves many (thousands) of male participants to swim across the atlantic ocean. there is only one winner which is the sole survivor. the winner does not mean that he reaches the target first. the price is thousand times more the size of the winner. oops theres too much clues now. does anybody noe of this race? name it.\\n\\nthis is an easy question so the 1st rite answer gets the points."},{"label":"sport","text":"who's your fave a1 racer? "},{"label":"other","text":"What happened to the Palestinian people after Israel took it over? "},{"label":"science","text":"What is an \"\"otis bulb\"\"? Pertaining to genitourinary surgery."},{"label":"science","text":"what actually is this fart (gas) made of? "},{"label":"sport","text":"Manchaft, seleçao, ça veut dir quoi en français? Manchaft (Allemagne), seleçao (Bresil)"},{"label":"sport","text":"what   chance  does   africa   stand   in   this   world    cup? what  i   mean   is  that, africa   have  struggle  to   qualify  the  world  cup.but  do  think  africa  will  make  it  to  the  quater  final?"},{"label":"entertainment","text":"What college did Brad Pitt and Sheryl Crow attend? "},{"label":"science","text":"What happens when regulation is altered? biologically speaking"},{"label":"entertainment","text":"How many of you,who likes Star Trek,would like to see a tv series solely based on Klingons? one can go anywhere with it from dealings with the federation to war times with the Romulans or have the series based upon klingon civil war to where whichever side wins controls the Empire."},{"label":"science","text":"what is funda behind first light? its regarding cosmology"},{"label":"science","text":"Statics problem... please help me get started? The door brace AB is to be designed to prevent opening the door.  If the brace forms a pin connection under the doorknob and the coefficient of static friction with the floor is equal to 0.5, determine the largest length L the brace can have to prevent the door from being opened.  Neglect the weight of the brace.  Please help and explain how I would go about doing this... I don't get it"},{"label":"other","text":"how do I find my POP3\/IMAP\/SMTP to set up outlook? "},{"label":"entertainment","text":"What are the names of the Harry Potter movies, in order? "},{"label":"other","text":"What should I get my employees for Christmas? I manage 5 females. One is 19, one is 22, and the other three are 40-something.  I'm looking for something nice but not very expensive. Any suggestions?"},{"label":"sport","text":"in any time start world cap? "},{"label":"science","text":"Dont forces come only into existance only when a mass is applied into another mass? Rather than a force being aplied to a single mass?"},{"label":"sport","text":"How well do you guys think Hirmada will play this year fantasy baseball wise? if you didn't know he's a rookie and he plays for the Flordia Marlins."},{"label":"science","text":"simple cauchy sequence proof? Prove (using the definition only) that the sequence of real numbers xn:= -1 + (1\/2) - (1\/3) +...+ (1\/n)*(-1)^n is a cauchy sequence."},{"label":"science","text":"does H2O2 + H2CO3 = 2H2O + CO? "},{"label":"sport","text":"who won staley cup in 1975? "},{"label":"other","text":"can first-time sex  trigger a   life-threatening asthma attack? "},{"label":"science","text":"how large is 74 acres? "},{"label":"science","text":"what is nanometer-scale bumps? i need to know what this is and where i can find information on it."},{"label":"sport","text":"does anyone here even respect barry bonds anymore? i think he is a big joke"},{"label":"science","text":"does time ever stand still? "},{"label":"other","text":"i want to hear your opinions on heaven and hell whether you think its true or false? "},{"label":"entertainment","text":"what is the best site to download free mp3 by click \"\" save target as\"\"? "},{"label":"other","text":"Give example for antipyriotic and analgesic activity? 1.PARECETMOL\\n2.BRUFEN\\n3.ASPRINE\\n4.NIMUSLIDE"},{"label":"science","text":"where might non-linear scales be used in everyday life? and how would these be simpllified to students? "},{"label":"other","text":"Whats your 'Lifes Work'?...................? What do you believe in your heart of hearts you are here for, what is your life for?....\\n\\nDo you want to be famous, want to change the worl, want to change other peoples worlds?? What are you ALL about??"},{"label":"other","text":"who wants a beer? "},{"label":"entertainment","text":"Favorite Beatles Song ~ Three Choices? You have three choices. Even if you don't really like these, just please pick the best one: \\n\\n- Hey Jude \\n- She Loves You\\n- Rain"},{"label":"sport","text":"How much money will George Steinbrenner have to spend to get the Yankees TO THE WORLD SERIES? He's spending over 100 million just getting to the playoffs, how much will it take for them to get to the World Series and predictably lose?"},{"label":"entertainment","text":"Who really enjoyed the performance of the \"\"natives\"\" on  \"\"KING KONG\"\". What country do u think theyre from? That little girl who lifts her arm and goes bonkers on Jack Black was my favourite and that old lady was great as well. Give me yo feedback on my ppls rite hurr."},{"label":"science","text":"im so curious about this question name 2 skills that farmers need to make the use of tchnology in agricultu? "},{"label":"sport","text":"Who do you think should go number one in the baseball fantasy draft, Pujols or A-Rod? These two guys are the hands down the best two in baseball statistically."},{"label":"other","text":"is it possible to find a Good Woman in El paso , TX? "},{"label":"sport","text":"how good is Mark Teahan? I remember Mark Teahan and John Buck was traded for Beltran and exchanged for Dotel. They must be pretty good minors players, but i ve never heard anything about any of them afterwards , what happened?"},{"label":"other","text":"what relieves a migraine? need to know what relieves a migraine"},{"label":"entertainment","text":"what is your fav song from the beach boys? i love the song good vibrations"},{"label":"science","text":"why do wagon wheels in old western movies seem to turn backwards? What is the term? sometimes when I watch a movie ,wagon wheels seem to be spinning backwards. an optical illuision? I ask you?"},{"label":"entertainment","text":"Gents - scam warning? In Tesco's car park, whilst packing shopping in your car you may be approached by 2 gorgeous 18 year old eastern european girls in tight tiny tops. They wash your screen with their ti.ts hanging out then ask you for alift to the next shop as payment.  On the way they strip and go down on each other, then 1 climbs in front and sucks you off.  The other nicks your wallet!  I had mine stolen last Tuesday and Wednesday, twice on Friday, then again today.  Be careful."},{"label":"science","text":"what are uses of e mathematical constant? can anyone discuss me about neperian number in nature, and everyday life, I meant the interesting uses of e"},{"label":"sport","text":"Who is da better Reciever: Randy Moss or Terrell Owens? I pick Moss despite his horrible season last season but who do you pick?!!!!!"},{"label":"entertainment","text":"Does anyone have any contact information for Eddie 'Duke' Edwards? "},{"label":"science","text":"What is the air speed velocity of a fully laden swallow? Both African and European, if possible..."},{"label":"entertainment","text":"Should the Yamster make a guest Appearance in family Guy? Why? (yamster is the mascot for Y! Answer)"},{"label":"entertainment","text":"Is The Grim Reaper cool? "},{"label":"entertainment","text":"There was a country music song in the 80's that had a phrase \"\"Don't mess with my toot-toot\"\" Who sang it? I sing this phrase to my grandchildren, I want to find the song to give them."},{"label":"sport","text":"looking for horse race tipsters with the name \"\"betbusters\"\"? "},{"label":"other","text":"Is it a good idea to meet a keypal? I learn that whatever they write to us does not mean it's true.So is it a good idea to meet a keypal?"},{"label":"other","text":"what 50 us coins make up a dollar? it can be quaters nickels dimes pennys ...............my teach said to figer it out and cant so maybe you can help me please!!!!:)"},{"label":"other","text":"Who gets laid more: the bartender or the disk jockey? "},{"label":"entertainment","text":"Who else is getting tired of this? Are you getting tried of Pop music like Jessica Simpson, Britney Sprears, etc. and the current gangsta hip hop music like Mike Jones, Lil' Wayne, 50 Cent, G-Unit,etc? 'Cause I'm sure as hell geting sick and tried of it and they (the music) should GO TO HELL!!!!!!! Anyone with me?"},{"label":"sport","text":"As a coach are there any good exercises that can get a crew (rowing) ratio? I am coaching a womens rowing 8, they are struggling at keeping there knees down long enough.  It is not flexablity."},{"label":"other","text":"Is masturbation normal? "},{"label":"sport","text":"Does anyone have an idea on how I can increase my jumping ability? please help no answer is a bad one.? "},{"label":"other","text":"i need more help? ok, well i have posted a few questions on help with building a computer, and need anymore advice i can get. What i mainly need to know it if these parts are compatable, and if there is anything i still need to get. i wont be gaming really hardcore on it, probably just WoW and other such games.\\n\\nRAIDMAX RX-9 SE ATX-911SEB Black SECC Steel ATX Mid Tower Computer Case - Retail\\n\\n\\nWestern Digital Caviar SE16 WD3200KS 320GB 7200 RPM SATA 3.0Gb\/s Hard Drive - OEM\\n\\n\\nABIT AN8 32X Socket 939 NVIDIA nForce4 SLI X16 ATX AMD Motherboard - Retail\\n\\n\\neVGA 256-P2-N381 Geforce 6800XT 256MB DDR PCI Express x16 Video Card - Retail\\n\\n\\nSONY Beige IDE CD-ROM Drive Model CDU5225 - OEM\\n\\nCreative Sound Blaster X-Fi XtremeMusic 7.1 Channels PCI Interface Sound Card - Retail\\n\\nAntec TruePower 2.0 TP2-550 EPS12V ATX12V 550W Power Supply - Retail\\n\\nZALMAN CNPS7000B-ALCU 92mm 2 Ball Cooling Fan - Retail\\n\\nCORSAIR XMS 2GB (2 x 1GB"},{"label":"science","text":"Which is important Mobile Phone or Computer? "},{"label":"science","text":"What day is it if today was the day that the one millionth second of the year happened? "},{"label":"science","text":"why earth moves round the sun? "},{"label":"entertainment","text":"How does my hair look today? And my makeup...is it all right?"},{"label":"sport","text":"I'm writing a paper on Lipids and the athelete.  Need help with material? "},{"label":"science","text":"The primary metallic element that's added to steel to make stainless steel is? A. antimony. \\n    B. silver. \\n    C. tungsten. \\n    D. chromium."},{"label":"other","text":"when is saint patty's day? "},{"label":"entertainment","text":"Gilmore Girls? Where is the cheapest place to buy the seasons of Gilmore Girls?"},{"label":"science","text":"What is an NP complete problem ? "},{"label":"other","text":"WHy are guys so mean to their girlfriends around other guys? My boyfriend really likes me, but he acts really mean to me around his other friends!!! WHY?!?!"},{"label":"other","text":"how can i find out how god is my credit and how can i fix it.? "},{"label":"science","text":"What if the surface of the Earth became completely flat or smooth? "},{"label":"sport","text":"Is it just me or does Kobe have a lot of nerve? I just watched a video Beyond the Glory with Kobe from when he was like 22 and he says in the video when Jordan was coming up he didn't like him because he was a Magic fan. Excuse me but who does Kobe's game resemble more Magic or Jordan. He even shoots the basketball like him and copies his gestures."},{"label":"entertainment","text":"Have you ever....? Kept three cell phones in service at once??"},{"label":"science","text":"What can you tell me about the Lyra meteorite shower\/constellation? History, photos, etc.? (April 21-22, 2006) "},{"label":"sport","text":"which team do you think is playing better? The Steelers or the Browns. \\nBoth their records are 2-5"},{"label":"other","text":"Iranian development issue? Does anyone else feel the United States should stay out and let the United Nations handle the iranian nuclear development problem and not spearhead any military action...afterall, we already are trying to take on too much already."},{"label":"science","text":"why haven't we returned to the moon? "},{"label":"entertainment","text":"do u think they will make a music video for The Teriyaki Boys - Tokyo Drift? becuase in the previous fast and furious movies, ja rule and ludacris both made music videos for the soundtrack and do u think there will be one for The Teriyaki Boys - Tokyo Drift????\\n\\nwould u know where i can download it?"},{"label":"entertainment","text":"What is theme song for the Jack Lemon movie April Fool? "},{"label":"entertainment","text":"who is gonna win american idol? "},{"label":"other","text":"is protein powder even good for weigt loss and not mass gain? "},{"label":"entertainment","text":"Who sang the song \"\"the woman on your arm\"\" and I don't mean the bing Crosbey one? It is definately not bing Crosbey who sang it, it's been played on radio 2 before and it's about a man and a wife till they die."},{"label":"science","text":"Anybody knows the Chapman-Kolmogorov equations? "},{"label":"other","text":"Check my answer on english usage? Amazing May and Marvelous Melissa ( juggle, juggles) twelve chickens and a chainsaw.   answer I picked was \"\"juggle\"\"\\nIs this right?\\n\\nWhat verb tense is the word in parenthesis: present, past, future, present perfect, past perfect, future perfect.\\n\\n1.  The movie-goers (had enjoyed) the first half of the movie.\\n\\n2.  Then the film (stopped).\\n\\n3.  The audience (will become) even more restless shortly.\\n\\n4.  The projectionist (has lost) the final reel of the movie.\\n\\nAre my answers right?\\n1. past perfect\\n2. past\\n3. future\\n4. present perfect"},{"label":"other","text":"Is it law to provide my employer with details of my medical history.? I have worked for my employer for 10 years and now they are asking for medical details, they say they do it every year to update the records but i know i never have been asked. I do have a medical condition my site manager is aware of it, ive never taken time off sick with it."},{"label":"sport","text":"how much is Jack Jackson's rookie card worth? "},{"label":"sport","text":"what i do to protect myself from tanning in night swimming because of clorine? "},{"label":"science","text":"Why are the body's muscles not able to self-exercise themselves? "},{"label":"entertainment","text":"who sang this song? words are: baby don't look back, you just might see me cry. boys are not supposed to cry am trying to find this old song sung I think in the 70s. need to know the name of the group who sang it and the proper song title. cheers."},{"label":"entertainment","text":"Who is the writer of Harry Potter Movies? "},{"label":"other","text":"Examine Odysseus' relationship to the supernatural universe surrounding him. At what moments does he lack? control over his surroundings? At what moments does he seem in command of his own fate and that of his companions? What message may we inter from Homer's treatmen of Odysseus' relationship with the gods? What do we learn about the poet's views on human nature and its interaction with forces beyond its control?"},{"label":"science","text":"What happens when soldiers march on the bridge? I heard that bridges collapse 'cause of that.WHY!!???"},{"label":"sport","text":"simply want to know that when the passion of world cup will begin? world cup schedule"},{"label":"science","text":"Site for synthesis of ZnS nanocrystals using ZnO? it 'must' use ZnO or dimethyl zinc as precursor"},{"label":"sport","text":"How do they \"\"colour\"\" or shade the football\/soccer pitch\/lawn? "},{"label":"sport","text":"Need Password for TW PGA Tour 2k5 to unlock positive celebrations. (TIGERMOBILE not 4 celeb.)? "},{"label":"other","text":"How do you stop a pedophile that is using this service? An individual that goes byt he name of Chester the Molester has been using this service to ask questions about becoming a Big Brother,his attraction to a 14 year old when he usually likes 6 year olds, if he goes to jail, will anyone bring their kids to visit? If you click on his avatar and look at the answers he has given to innocent question, and the other types of questions he has asked, it's really disturbing. Is anyone else not amused by this? A one time tasteless joke is one thing, but this is all this user does. I'd like to see him prosecuted criminally or punished in some way. At the very least I'd like to get him blocked. My neices and nephews use this service. I'm open to suggestions, and I hope anyone who feels the same will make a complaint to Yahoo! answers. Any other suggestions about how to stop this guy?"},{"label":"entertainment","text":"What did I do, What did I say...? There's a song that says...what did i do, what did i say, to turn your angel eyes my way...and its kinda slow, do you know who the artist is???"},{"label":"other","text":"how can I shop on ebay with out a credit card? "},{"label":"sport","text":"where can record weights of game animals be found if they are recorded? i especialy want bobcat and lynx weights if these are consitered game animals"},{"label":"entertainment","text":"How can I find this PBS documentary? My brother and I once saw a fascinating documentary on television about the industry where people send in song lyrics and musicians write and record the songs for them, then send them the recording.  This documentary included discussion about what kinds of people send in these lyrics, the musicians who write the songs, and so forth.  It was the most fascinating documentary on something I didn't care about I've ever seen.  I'd like to watch it again, but I don't know what it's called.  Does anyone have an idea how I can get a hold of this program?"},{"label":"other","text":"what is the best way to resist giggling during oral sex? my bf wants to eat me out and i am very ticklish and hes fingered me and thats about it and im nervous about letting him"},{"label":"sport","text":"im fed up with the name of brazil as a forever winner i hope italy win who agrees? "},{"label":"science","text":"Where does the term \"\"sweating cobs\"\" come from? "},{"label":"science","text":"some math - 7th grade!!? 1. What time is it on a twelve-housr clock 6 1\/2 hours after a military clock shows 1500?\\n\\n2. In what year was Bruce Springsteen born? Two digits in the year are the same.  The sum of the digits is a prime and the product of the digits is the square of 18.\\n\\n3. Berlin, prewar capital of Germany, lies within the borders of East Germany. The cit is divided into East Berlin, with an area of 156 square miles and a population of 1,146,00; and population of 1,890,300. Which part of the city has more people per square mile and by how much?\\n\\n4. As of 1984 the New York Yankees had been in 33 World Series.  They had won teice as many Series as they had lost. How many World Series had they won?\\n\\n5. The first Olympic marathon in 1896 was won by Greece in 2 hours, 58 minutes, 50 secounds. In 1984 Portugal won the marathon with a time of 2 hours, 9 min, 55 sec. How much time did Portugal cut off the 1896?"},{"label":"other","text":"What is your middle name? What is your middle name? Do you like it? Why or Why not?"},{"label":"entertainment","text":"what is a good site for music videos? "},{"label":"science","text":"In a hydropower project, can a helical penstock give more  kinetric energy to the runner of the turbine.? Like in a rifle, the groves or rifles inside the barrel give more energy to the bullet in comparison to a plain barrel gun with the same length of barrel. Can a helical shaped penstock give the discharge more energy? Can someone help..? and carry simulation modelling on this idea?"},{"label":"sport","text":"at the end of German and Argentina match what was the fight about? i saw argentina player get into a fight with german manager at the end of the quarterfinal what happend."},{"label":"science","text":"How do i put a mixed number into a decimal????? "},{"label":"other","text":"ladies..what do you hate the most about men? "},{"label":"other","text":"Does anyone remember the Republican Wednesday club ? "},{"label":"sport","text":"What's Detroit going to do with all the homeless people and crack addicts while the SUPERBOWL EVENT is in town "},{"label":"entertainment","text":"I'm looking for Anonymo.? Anonymo? Please give me your yahoo e-mail address. I have a question to ask you in private, and if I ask it here, yahoo answers might not post it. If you do this, I'll give you the 10 points you wanted for answering my question."},{"label":"sport","text":"Why is it when celtic wins you always just come out with excuses, why not just accept you were beat? "},{"label":"sport","text":"who is the best? who is the best quarter back ever from the first Superbowl to now"},{"label":"sport","text":"What the does word \"\"Ashes\"\" mean in Cricket? When it comes to the \"\"Ashes\"\" it is a huge thing in Cricket, why is that?"},{"label":"science","text":"What are the three essential components that make up paint? "},{"label":"other","text":"I am thinking about masters of Bus. Admin. online how much per credit hour.? what would be the the cheapest program to take?"},{"label":"entertainment","text":"What happened to Christian Music???? not that i care... my friend megan is big in Christian music weird person she is............"},{"label":"science","text":"Heat change per gram of potassium bromide dissolved in water? When 2.50g of potassium bromide dissolves in 1.00102g water in a calorimeter, the temperature drops from 22.657 degees celsius to 21.661 degrees celsius. What is the heat change per gram of potassium bromide dissolved in water? Assume that al the heat comes from the water (c= 4.18J\/g deg C)"},{"label":"sport","text":"Does anyone know how Eddie Guerrero died? "},{"label":"science","text":"why do apples grow on trees? "},{"label":"other","text":"What is the wierdest state law you have heard of\/read about? "},{"label":"science","text":"can i view  darwin's  papers  on  the  internet? "},{"label":"science","text":"what is samir asmar electrical engineer? "},{"label":"science","text":"Rank the frequencies of the following types of Electromagnetic Waves in decreasing order? Microwaves\\nX-Rays\\nVisible Light\\nUltraviolet Light"},{"label":"entertainment","text":"Does anyone know a website that is about Toy-Box? I type it in a search engine and I don't get what I want! "},{"label":"entertainment","text":"Transposition? Music 101"},{"label":"other","text":"Expungment of Felony record in Texas? "},{"label":"other","text":"how do i have an orgasm? I am a 19 year old women...I have been sexually active for a few years. I have a baby, but I have never had an orgarm, I feel a failure or like I have something wrong with me, why cant I orgasm? how can I orgasm?I have a partner and we have sex at least twice a day. please help"},{"label":"entertainment","text":"what is R&B singer Usher's real name? "},{"label":"science","text":"List a reagent that will separate the following mixtures by formation of a precipitate. List the Precipitate.? 1.Ba(NO3)3 (aq) & FeCl3(aq)\\n\\n2. LiNO3(aq) & AgNO3(aq)\\n\\n3. Pb(NO3)2(aq) & AgNO3(aq)\\n\\n4. Mg(NO3)2(aq) & NaNO3(aq)"},{"label":"entertainment","text":"What do you think is better..... X Men 3 or Superman Returns? Just curious to know your opinion..."},{"label":"entertainment","text":"Do you disregard cut-and-paste answers? Such as a simple Wikipedia answer or what-have-you?"},{"label":"sport","text":"I'm not sure if I've seen this question on this site before.     When was the last time USA won the World Cup? "},{"label":"science","text":"cable television in block diagrams? urgent"},{"label":"science","text":"Spider uses mouth or tail to eject the net? "},{"label":"entertainment","text":"Music Trivia #6? The first person to guess the correct song title\/artist will get ten points!\\n\\nLyrics\\n\\n\"\"Now if he don't stop eatin' my eggs up \\nThough I'm not a real bad guy \\nI'm gonna get my riffle and send him \\nTo that great chicken house in the sky "},{"label":"science","text":"Use the true equation 3x-2=3x-2 to create an identity.? Other great challenges are to use the false equation 1=2 to create an equation with no solution.\\n\\nCreate an equation whose solution is x=3\\n\\nFirst to answer all 3 questions gets their answer as the best."},{"label":"sport","text":"Anyone can give me an exact number for how many SPORTs there is in the whole world?? Has there been any 'research' on this??"},{"label":"science","text":"How do you divide x^4+6x^3-10x^2+2x-1 by x^3+5 ? "},{"label":"entertainment","text":"Is it half full or half empty? "},{"label":"entertainment","text":"how do you dial 911? "},{"label":"sport","text":"help me please? at an air show 8 skydivers were released from a plane in a circle formation each skydiver was connected to each of the other skydivers with a separate piece of ribbon.  How many pieces of ribbon were used in the skydiving act?"},{"label":"science","text":"dear nerds everywhere, and ufo watchers.....? I know there are aliens that exist, because, well, space is endless, and you cannot tell me over the (estimated, but probably nowhere near close)99999999 planets in space, there is no aliens, but, do you believe we will see them ever, and if you give me some... classified info on *whispered* |205|W3||?"},{"label":"science","text":"can a flea see the moon? "},{"label":"other","text":"can i found e-mail address of my friend? "},{"label":"entertainment","text":"Any Ted Nugent fans?  Favorite songs?  Favorite CDs? "},{"label":"science","text":"2=3? prove? "},{"label":"entertainment","text":"Whic is ur favourite hangout zone? "},{"label":"entertainment","text":"geico caveman commerical in the airport? does anyone know the song that is playing in the Geico commerical with the caveman in the airport? its driving me crazy.. i just really like it!!!"},{"label":"entertainment","text":"What should I do if I am offered spotted dick by a stranger? "},{"label":"science","text":"Smart test 7? Express each decimal as a percent \\n1. 0.825\\n2. 0.06\\n3. 0.066\\n4. 0.628 \\n5. 0.4\\n6. 0.02\\nExpress each fraction as a percent \\n7. 7\/10\\n8. 3\/4\\n9. 17\/20\\n10. 5\/8\\n11. 5\/5\\n12. 23\/25\\nExpress each percent as a fraction in the simplest form\\n13. 14%\\n14. 61\/4%\\n15. 48%\\n16. 56%\\n17.30%\\n18. 2 1\/2%\\nExpress each number as a %\\n19. 1.95\\n20. 35\\n21. 0.00112\\n22. 63 \\n23. 5 3\/4"},{"label":"sport","text":"is there a site where i could just type in a year and name of a baseball card and find out how much its worth? "},{"label":"sport","text":"[tennis players] how do you deal with pushers (junkballers)? how would you handle a frustrating opponent who hits consistently weird shots with not alot of pace but can get the ball back almost everytime?"},{"label":"other","text":"losing abdominal fat ... tyres around my waist :(? "},{"label":"entertainment","text":"Who sang the song Louie, Louie (not The Kingsmen version)? Other words: I'm gonna cry, took her home to meet my momma and pappa, man we hadda terrible fight....makes no difference if your black or white."},{"label":"sport","text":"world cup result? "},{"label":"science","text":"Isnt the nature of light so simple to understand and obvious that its completly minsunderstood? "},{"label":"other","text":"Using Alexa.com, how can I find the site who has rank #4000? Thanks!"},{"label":"sport","text":"Do u know any software where i can watch the world cup for free? i heard of some online tv softwares where u can watch the world cup, do u know any"},{"label":"science","text":"Aren't we aliens too? If aliens exist doesn't that makes us aliens to the aliens?  think about it."},{"label":"science","text":"How do you find tonic water on the periodic table?? I can't find it on an old one.  Can anyone give me the link to the new one with tonic water on it.  I NEED THIS FOR CLASS!!"},{"label":"science","text":"Can biking on uneven terrain be faster than on flat? Assume a flat course on which a biker can average 30 kilometers per hour, if putting his maximal effort.\\nNow assume the same biker goes on a terrain the same length, half way uphill and half way downhill (ending in the same location where he started).\\nCould he obtain a better time on the second course? Like if he is able to maintain an average of 20 km\/h uphill the bike would propel him at more than 45 km\/h downhill?"},{"label":"entertainment","text":"Ice Cold Tea or Ice Cold Lemonade? Which do prefer to drink on a hot summer day?\\n\\nI love lemonade."},{"label":"science","text":"What lies outside of our universe and how far does it go? "},{"label":"other","text":"puberty question? what age can puberty go to for guys?"},{"label":"other","text":"Which is the best city in the world? "},{"label":"other","text":"Why does water have a nasty after taste? "},{"label":"entertainment","text":"whats gackt sexuality? im unsure if he's like straight or bi or wat?"},{"label":"science","text":"do fishes sleep ? "},{"label":"entertainment","text":"Britney: I'd still do her despite all her shenanigans....would you? "},{"label":"entertainment","text":"why being born in june u have to have two bad signs?( cancer & crab) lol? "},{"label":"entertainment","text":"Knock Knock? Who's is there?\\nCow.\\nCow Who?\\n.......\\nfinish the rest and send in!"},{"label":"science","text":"What is liquid pressure and Pascal's law of hydraulics? Application of pascal's law"},{"label":"other","text":"why does xmas day is set on dec 25...? go... 4... pro..."},{"label":"entertainment","text":"which anime show is better inuyasha, full metal Alchemist, or beyblade.? i need some answers plz. its for my friends survey."},{"label":"other","text":"What does BMI mean on the biggesst loser ? "},{"label":"other","text":"Christians, Muslims and Jews,  Where is heaven? The book says that it is high above the clouds.  Man has sent probes beyond the corner of the solar sytem, yet there is no sighting of heaven.  And if you are in space, beyond earths' atmosphere, there is no concept of high and low."},{"label":"science","text":"The commercial use of enzymes (proteases) in detergents? i've been doing research on this topic but didn't find exactly what i was looking for!\\ncould you guys help! plz\\ntx"},{"label":"science","text":"In the medical field what is a D.O.? "},{"label":"other","text":"please tell me effective ways on being the topnotcher in class aside from studying.? "},{"label":"entertainment","text":"is hank williams jr.and kid rock related in any way? "},{"label":"other","text":"How do I restore my \"\"Copy & Paste\"\" commands on my PC? Ctrl+C\"\" and \"\"Ctrl+V\"\" have suddenly stopped working. Did I press a key by accident? Thanks for any help!"},{"label":"entertainment","text":"what are some good love u know romance... movies? "},{"label":"other","text":"Why do prostitutes get arrested but their employers don't? It seems that all of the laws against prostitution come down heavily on the prostitutes and not the \"\"johns\"\". Wouldn't it be more effective to go after the people who fund the illegal activity in the first place?"},{"label":"other","text":"Is the US forgeting Africa ? "},{"label":"other","text":"Black Stool? I've had black stool for a few days now. It doesn't smell any worse than usual, but it is rather sticky and sinks. I haven't had any pain around the midsection for the last several days, but earlier today (give or take an hour), I started having some.\\n\\nIs this just because of diet or could I be bleeding internally?\\n\\n~~Naomi"},{"label":"sport","text":"What does G.Y.E.R.O. stand for? "},{"label":"entertainment","text":"What are the movies Val Kilmer was in? "},{"label":"sport","text":"What is Ramnaresh Sarwan e -mail address? i want it now please"},{"label":"entertainment","text":"Is it just me, or does the Lord of the Rings (movies) over do the love between Aragorn and Arwen? When I was reading The Lord of the Rings, I realized that there are not that many parts when Arwen and Aragorn are together. (not counting the appendix) The movies overplay their love."},{"label":"entertainment","text":"What songs get you pumped up when you are working out? "},{"label":"entertainment","text":"Rare Coldplay\/U2 Duet? I stumbled across \"\"What's Going On\"\" on limewire and I want to know if it's real, and any other information on it, because I think if Coldplay and U2 would have recorded a song together, I would have heard more about it."},{"label":"sport","text":"ce soir , France ou Grece? "},{"label":"science","text":"why are photochemical reactions considered fast reactions? "},{"label":"sport","text":"Best soccer cleat on the market??? what is the best soccer cleat out there for under about 80 bucks\\n. i want kangaroo leather but i am open to any suggestions"},{"label":"sport","text":"when was the first Ohio state Michigan football game where and what year????? "},{"label":"entertainment","text":"what is this song?!?!?!? IT GOES \"\"MY WISH FOR U IS THAT LIFE ( BLAH BLAH BLAH) THAT YOUR DREAMS STAY BIG AND YOUR WORRIES STAY SMALL\"\" SOMPTHIN LIKE THAT!!\\nTHANX!!!"},{"label":"sport","text":"if orlando bloom and i licked eachother's tonges, but not french kiss what would it be? i have done all the research and orlando or i aren't french and we would lick eachother's tongues and it would taste like italian food so would it be italian kissing?"},{"label":"sport","text":"name the longest playing shortstop to 2nd players to 1 team? for 1 team they played together until 1 of them retired,,,,the other player went to another team after the other had retired"},{"label":"other","text":"Why is the british justice system so weak? "},{"label":"science","text":"what is the relationship between ubiquitin protease system and huntington disease? genetics"},{"label":"entertainment","text":"x-men psylocke versus elektra, who will win? "},{"label":"sport","text":"Can the Miami Dolphins win the Super Bowl in 2007? If the Miami Dolphins were to win Super Bowl XLI next year, they would be the first team (that I am aware of) that would win on their home field at Dolphin Stadium."},{"label":"other","text":"In a very difficult situation how do you teach others the truth? "},{"label":"sport","text":"what is a good entry level paintball marker for beginers? im thinking of the tippmann A-5"},{"label":"science","text":"determine the force available from a pneumatic actuator with a piston diametr of 30mm and an air press of 8bar "},{"label":"other","text":"I have read thousands of books. Do you agree the Bible is the worst-written, most innacurate of them all? "},{"label":"entertainment","text":"who is your favorite 90s artist and what is your favorite song they sung? "},{"label":"other","text":"what  is the thing called when you smell it when you are unconcious? the thing that they break up and make you smell it to wake up when you pass out"},{"label":"sport","text":"Who do you WANT to win the NBA Finals? (want to see if anyone thinks the same as me)? I want the Suns..."},{"label":"sport","text":"Who is your favorite tennis player at the moment? "},{"label":"science","text":"how many countries are there worldwide? "},{"label":"entertainment","text":"is hunter a boy or girl name don not say both!? "},{"label":"other","text":"I  i started menopause at the age of 42.  roughly how long will i continue to have to take hormone pills? I'm 53 now and if i miss a couple of days of not taking my hormone pills, the hot flashes start again, and my moods really swing.   i become a raving witch."},{"label":"science","text":"hydrogen peroxide? does anyone know why hydrogen perooxide is harmful to the cell and does anyone have a link that has a list of chemical properties of catalase? thnx"},{"label":"sport","text":"Does anyone know where to buy Youth size 10 Dressage Coat? I cant seem to find a Dressage Coat for Youth.  All I can find are Hunt Coats.  Do they even make Dressage Coats for Youth???"},{"label":"entertainment","text":"xcuse me!!? huh?? what is this?? a woman is in a bakery shop . she has asked 4 a 4 her cake but da shopkeeper gav her somthin else!!\\nwhat could that b??\\nclue:its not found any where on earth??"},{"label":"entertainment","text":"What do you think of Lost after last night's episode? So the whole theory they throw out there, is that the whole island and everything that has happened is all inside of Hurley's head (he's crazy). Do you think this is the secret behind it all, or just another ploy to throw us off? Also, what do you think could be the answer to all the craziness on the show? Theories welcome!"},{"label":"science","text":"How does fire behave when there is no gravity? On the MIR space station for example."},{"label":"other","text":"is oral sex harmful??? "},{"label":"entertainment","text":"Jazz Question...? Who was that afro-american female who sang during Count Basey Live 1968 concert in Germany Berlin? She was amazing!"},{"label":"entertainment","text":"whats that new song called by fallout boy? "},{"label":"science","text":"what is the amount of antimicrobial used in shoes? There are different parts of shoes that requires antimicrobials.\\nThe upper, midsoles, inner soles and outer. I would like to find out the usual amount used in the midsoles and the outer."},{"label":"sport","text":"Are deer color-blind? "},{"label":"entertainment","text":"what is the theme of \"\"the phantom of the opera\"\"? it is the musical movie"},{"label":"science","text":"Other Mixtures? I'm doing a volcano, what are some other mixtures than the classic that could actually create a bigger explosion??"},{"label":"science","text":"what was the name of the battle fought in the Revolution War? "},{"label":"entertainment","text":"Pussy Cat Dolls or Black Eyed Peas? "},{"label":"science","text":"company for cemecal at espaniea? "},{"label":"sport","text":"Where is a good website for doing free online hockey pools? "},{"label":"science","text":"why is salt water important for fish? "},{"label":"sport","text":"can you watch live nba games on the computer? "},{"label":"entertainment","text":"Who whent to \"\"horror fest\"\"? What did u think? I went i thought they were decent\\nWhat did you think?"},{"label":"science","text":"From which plant or tree is essence of vanilla obtained? "},{"label":"entertainment","text":"Your favorite 80s band? What is your favorite 80s band\/singer?"},{"label":"other","text":"So who WAS the fairest? Who deserved the apple? Aphrodite?Athene? or Hera? "},{"label":"other","text":"i love him but how will i know if he feels the same way for me without having to ask him directly? "},{"label":"other","text":"could someone explain about google earth? "},{"label":"sport","text":"Can someone tell me the score from soccer aid last night please? "},{"label":"entertainment","text":"Need to know the best PS2 games? I have just bought a PS2 but dont hav good games. CAn u please suggest some great games. I am mostly into racing and strategy FPS like call of duty n stuff."},{"label":"science","text":"What is meant by the term eythropoesis?and what part of the body does erythropoesis take place? "},{"label":"sport","text":"What is the best speed\/distance running watch? Is GPS or footpod technology more accurate? "},{"label":"other","text":"How does one know when they are ready to commit to another  person ,after a divorce? "},{"label":"science","text":"how would one go about solving the Arithmetic Sequence of a1+a2+a3...+a98=2006? "},{"label":"science","text":"What is the colour of human dried plasma, and is the dried plasma a powder or flakes? "},{"label":"other","text":"How come Asians get super happy when you ask them to take a picture for you when you're on vacation? "},{"label":"entertainment","text":"Why do so many people hate Rachael Ray? I like her show 30-Minute Meals. She makes really good food. My boyfriend HATES Rachael but loves her recipes.( i'm the one who cooks) He finds her annoying but I think she's funny. Your thoughts?"},{"label":"sport","text":"What's the better baseball rivalry? Chicago Cubs VS St. Louis Cardinals\\nNew York Yankees VS Boston Red Sox"},{"label":"entertainment","text":"if fat joe and 50 Cent would be placed in a wrestling match, who do you think would win? "},{"label":"other","text":"Looking for Carla Noga?...her stepfather adopted her? her father is David P Noga.  I am her half sister, and older than her. I am looking for her. When her mother remarried, stepdad adopted her and the last now name changed.... Don't know her new last name. She should be around 25 yrs old."},{"label":"entertainment","text":"How can you tell someone is on cocaine? How can i tell if my boyfriend did cocaine last night? Without asking him... is there anything to look out for?"},{"label":"other","text":"How do you stay fit and healthy when you have to stay inside? How do you stay in fit and be healthy when you have to stay inside your bedroom?"},{"label":"other","text":"Do you think I'll be accepted to any college with a score of 840 on SATs other than community? I have a 3.2 GPA ,alot of community service, and played some sports. Would any of that matter with a sucky score like that?"},{"label":"entertainment","text":"Who sings this? \"\"and that ? song keeps playing in my mind, 3 1\/2 minutes, felt like a lifetime\"\"? The questionmark in the lyrics is a word that sounds like \"\"oriun\"\" [sp?] The song is about losing a friend right before graduation. There is also something in it right before those lyrics about \"\"your mother didn't mind, like I thought she would\"\" Love this song.  Can't find it anywhere. I thought it was sung by a band called \"\"Saving Ezra\"\", but I can't find any info. on them either. Thanks for any help."},{"label":"science","text":"is Vibrio a moneran and if so what is a vibrio? "},{"label":"sport","text":"WWE Ratings...? How do you think having K-Fed in their storyline will affect WWEs ratings?  Who\/what else do you think highly affects their ratings?"},{"label":"other","text":"what is the best thing to give your boyfriend on his b-day? will my bf birthday is coming up and i don't know what to give him would somebody please or girls please help me out?"},{"label":"science","text":"What state of matter does fire belong to? Plasma? How does that exactly work? "},{"label":"entertainment","text":"Riddle: 3 boxes? 3 boxes.\\n\\nthe first box contains a green box with a question mark stick onto the top right hand corner.\\n\\nthe second box contains a green box with a smiling face stick onto the top right hand corner.\\n\\nthe third box contains a green box with an exclaimation mark stick onto the top right hand corner.\\n\\nwhat is it?? \\n\\n=)\\nit's lame."},{"label":"other","text":"what does it mean when everytime i try too update my computer it doesn't install successfully? its been like this for awhile now i've tryed many things too solve this problem nothing has worked can someone please help me out i would really appreciate it thanks"},{"label":"science","text":"Secant function? Let theta be an angle in standard position with a point P9x,y) on the terminal side distance of r equals the square root of quantity x squared plus y squared from the origin (r is not equal to zero). Then the secant function is defined by?\\n\\n\\nI come up with r\/x , x can not = 0. Am I correct here?"},{"label":"science","text":"How can I make an small atom bomb? "},{"label":"other","text":"Do you you see the Imagery of Christianity as an affront to Jesus? Someone asked this question, to which I responded that I find all of christianity an affront to jesus. By this I meant that modern christianity is a perversion of his message. It represents an established instituition that is largely corrupt and the atithesis of what he taught. Why would this response have been deleted. I can only assume that it was the result of some narrow minded, right wing christian who is blinded to christ's true message"},{"label":"sport","text":"Hi! I will ever found an used paraglide within 100$? "},{"label":"other","text":"How long does it take you? Does it take you being on this site day and nite to get to level 2 ?????"},{"label":"entertainment","text":"what is the name of the movie about the paperboy? "},{"label":"entertainment","text":"Panic! At The Disco question? where are they right now? are they in england or japan or the u.s. tour right now."},{"label":"sport","text":"What is your favorite thing to do outdoors? "},{"label":"sport","text":"How did you feel when you heard that cannavaro receives the 'world player of the year' award? well, i think he deserved to win, but dont you think that buffon too deserved it?"},{"label":"sport","text":"D'ou vient le terme \"\"coiffeurs\"\" signifiant les remplaçants d'une équipe de foot? "},{"label":"entertainment","text":"Why are so many MP3 files misslabelled? why do thousands of muppets put the wrong band name in the file, as if they just took a guess? is it pure ignorance or is there some sinister reason for it? I find it infuriating, as anyone who then gets the file from me will think I did it and will label me as a clueless moron. e.g. only a complete idiot blunders through life thinking Van Halen sung 'Stairway to heaven' or that Radiohead did 'Hotel california'  What the hell is going on?"},{"label":"sport","text":"Quarter Finals? Do you think England will meet Portugal in the Quarter-Finals of the World Cup?"},{"label":"other","text":"Is there a way i would know if someone else is accessing my yahoo mail? "},{"label":"other","text":"Have anyone try Breast Gain Plus before? I did a research on which product works the best and Breast Gain Plus seem to be one of the top rated breast enlargement pills.  Anyways, I wanted to try Breast Gain Plus but I'm not exactly sure if it really works."},{"label":"other","text":"how did i get  along? I just got a computer. I have always stayed away from getting one because I was afraid of them. I am 52 snd catching up with the rest of the world. Its about time.."},{"label":"other","text":"you wish to display a 10kHz sine wave on a oscilloscope. What setting of the SEC\/DIV control will show one? complete cycle in 10 divisions?"},{"label":"science","text":"how can you change the density of an object? just asking....i need help...^.^"},{"label":"science","text":"If your obesity is inherited, will diet\/exercise work? "},{"label":"science","text":"How does Stem cell Gene Therapy work? I undersatnd in regular gene therapy the healthy gene is introduced into a cell by a viral vector but how does stem cell gene therapy work?"},{"label":"entertainment","text":"What is this damnn song??? i made a thousand songs that made you move your asss"},{"label":"entertainment","text":"anybody watch grey's anatomy if so what happened this week? "},{"label":"entertainment","text":"Do you like Shahrukh Khan? "},{"label":"entertainment","text":"I need an 800 phone number for z88.3 radio station in Orlando Fl I am in Chicago, can anyone help me? "},{"label":"science","text":"were can you buy a complete wind turbine inc batteries etc kit for generating electric? "},{"label":"sport","text":"Do you think Maurice Richard is the best NHL player of all the times? "},{"label":"sport","text":"y are peopel so 2 faced? well?!?!?!"},{"label":"entertainment","text":"What is the amount of time between the events at the end of X-Men 2 and then when they find Jean in X-Men 3? Has it been a few days? Weeks? Months? I realize at the beginning of X-Men 3 they go back twenty and ten years, I mean from the end of X-Men 2, to when they find Jean at the lake in X-Men 3."},{"label":"other","text":"How do i know if my best friend is gay without asking? My best friend for a long time has been acting kind of strange lately. he has always acted feminine at times but not overboard. but latly he has started crossing his legs like a woman and just not like he used to. this is all kinda hard to explain when i dont know wat to think. it wouldnt bother me if i knew he was gay but it bothers me that he is my best friend and may be keeping a secret from me.thanks for any advice u can give. i just dont really wanna ask hime so i was wondering if there is a way to tell."},{"label":"other","text":"What do you think of the Texas virtual border watch? "},{"label":"sport","text":"capri 14.2 vs lido racing? "},{"label":"sport","text":"Who are your pics for winning NFL teams this weekend? I'm in a pool and not sure who to pick!!!"},{"label":"other","text":"Whose Trompie? you sound cool!? "},{"label":"sport","text":"Who invented soccer? "},{"label":"other","text":"If your wife was unhappy, what would you do? How far would you go to make her happy and keep her happy?\\n\\nWhat would you do in order to make her happy?"},{"label":"entertainment","text":"what is going on in guys heads....? when their watching chick flicks?"},{"label":"science","text":"coin flips? what are the chances on two coin flips that both turn up heads?"},{"label":"other","text":"what could cause you to have your period twice in one month? "},{"label":"sport","text":"How long does it take to ride (bike) 10 Ks average? "},{"label":"other","text":"biggest mammal? "},{"label":"other","text":"Is losing 10 pounds in 2 months a realistic goal? And if so, what kind of exercises or cardio can I do? I'm a 14 yr old girl with a height of 6' 4 (160cm) and I weigh like 110 pounds. I'm trying to lose about 10 pounds or more right now since it's summer vacation and I have time. What are some cardio or exercises that I can do  to lose weight without gaining it all back when I stop exercising? Right now, my eating habits wouldn't be exactly called \"\"healthy\"\" but it's going to be when I'm on my diet and doing all the cardio and exercises and stuff during this summer, then, after losing 10pounds, I'll just watch what I'm eating more. Swimming, I know, is an option, but running I heard would make my thigh and butt big when I stop (and that would be bad because they're already big and well, fat)."},{"label":"science","text":"what about nasa? "},{"label":"entertainment","text":"How do u feel when the buzzing alarm put an abrupt end to ur sleep ? "},{"label":"other","text":"What is a thing that boys like the most out of sex? "},{"label":"entertainment","text":"who sings the song cherry pie from the commercial where the three girls through their thongs at him? commercial about the satalite radio i think, he is singing and then he see's the girls and stops embarsed, then they through their thongs at them, it's on farmer vision, that's where i saw it, and either channel 7 or 9."},{"label":"other","text":"how do you pass a drug test? "},{"label":"science","text":"How do i calculate  the lowest grade i can get on the final to maintain my grade.? I have an 87 in a subject. It cant move to an A- (dont ask why), so what is the lowest grade i can get on the Final in order to just keep an B and get at the lowest an 80%.   Final is worth 15% of grade.\\n\\nTHANKS! 10 points."},{"label":"science","text":"A: 3-2i  B:5-i? A: 3-2i and B: 5-i\\n\\nChoices for answer:\\n\\nA is greater\\nB is greater\\nThey're equal\\nCannot be determined"},{"label":"other","text":"what basically is industrial marketing? "},{"label":"sport","text":"Can you tell me if there is a website for the results of the Missouri Womens state bowling tournament? "},{"label":"other","text":"Does going in a sauna make me loose weight.? "},{"label":"other","text":"How true is that guys can make their reproductive organ as much big as they want?if true,pls drop some details Is there natural ways or something?"},{"label":"sport","text":"when does the world cup start? "},{"label":"science","text":"Do all mushrooms float? If not which ones don't?"},{"label":"sport","text":"I have a baseball signed by 12 members of S.F.Giants including Willie Mays-Bobby Bonds? Mike McCormick Gaylord Perry and others anybody know what year they won the world series and what value this ball might have?"},{"label":"sport","text":"i live in south derbyshire and want to find a adult netball team? "},{"label":"other","text":"how to turn 1 PC into 10? [opearting system xp,98,2000]? http:\/\/userful.com\/images\/1-box-system-500x250.gif  [picture]\\n\\nfound pic*, but i'm unalble to find .........how it works in window operating system and what hardware is required, esp the name of the hardware"},{"label":"entertainment","text":"where could I download desperate housewives episodes,even if I have to pay,fast downloads,kazaa is too slow? "},{"label":"science","text":"How much longer will it take to invent teleportation? "},{"label":"entertainment","text":"Has anyone ever been close up to Hilary Duff like live in concert front row? "},{"label":"science","text":"how assemple a bell? electrical bell"},{"label":"other","text":"What are some things that  make you happy? Smile People Life sucks so grin and bear it. not much else you can really do.\\n\\n\\nIt involes mental health"},{"label":"entertainment","text":"Thankyou to all who replied, but, does anyone know if I can buy the wuzzles episodes anywhere at all? "},{"label":"science","text":"Which is more work - going up the stairs or going up an incline of the same height? "},{"label":"other","text":"Whos logo\/mascot is a blue castle with a family of 4 walking through\/under it? I am playing a trivia game that I received by email and it is driving me crazy!"},{"label":"science","text":"Since energy is neither created nor destroyed, then where did energy come from in the first place??? "},{"label":"entertainment","text":"Film class project on nudity? I am working on a project form my \"\"film criticism and history\"\" class about nudity on movies. it was easy to find movies with female nudity but i'm having trouble finding male full-frontal movies. please tell me the movie and if you can tell me year and director (it would help but i can find  it). Mainstream actors is best but not limited to it. If any female mainstreams that not too many know about also please include. Thanks!"},{"label":"entertainment","text":"where can i get the movie eraserhead for cheap? "},{"label":"sport","text":"will or will not the Mavericks win the NBA championship? "},{"label":"science","text":"What matrix which it square is equal to identity matrix? "},{"label":"entertainment","text":"What's your favorite anime? I have so many, Sailor Moon is my fave of all time, but I love Inyuasha and Naruto."},{"label":"sport","text":"what can i do to get a scholarship for basktball even though i'm not a blue chip player and I'm very good I'm a D-1 player but i play behind alot of favoritism at my school. I can score 18 points a game i'm a defensive threat and a very good team player. I'm 6'3\"\" and can play 1,2, and 3guard. I have a great jumpshot from anywhere on the court, can dunk, great passer, and i'm coachable."},{"label":"entertainment","text":"Have you ever seen a haddock with a headache? "},{"label":"science","text":"What is Coriolis effect? "},{"label":"other","text":"Is there anything that happened in 1612 thats extreamly important? I need to know for a collection of data I am collecting."},{"label":"other","text":"im 13 and im a b in bra size!!! do u think that big or sexi? "},{"label":"other","text":"6 yrs ago I talk a girl on net even v liv in same city after 3 yrs............? even v liv in same city after 3 yrs i fell in love when i told to her she response after that she left me and now she doesnt reply my email....i realy very love her i thnk about her all the day since 6 yrs....even i did never c her but v had many phone chat....what 2 do?"},{"label":"science","text":"Alegebra Help: A company employs 110 people in total....? A company employs 110 people in total (headcount). The company has  2.5% of staff  in HR, a sales and marketing staff which is 15% of the headcount and the remainder in Administration. The Administration consists of VPs and Admin Assistants. The number of Admin Asst are 10.5 more than the number of VPs.\\n\\nWhat is the number of Admin Assistants in the company?\\n\\nDue to a new round of venture capital funding, the company increases the total head count by 50%. The Administration now represents 80% of the headcount and there was no change in the HR staff. What percentage of the company is the sales and Marketing?\\n\\nOne year later, the company decides to have a head count reduction (layoff) of 30%. Administration and Sales and Marketing Departments were affected by the reduction. Administration lost 61 people more than Sales and Marketing. After the reduction what percentage of employees are in the Administration?"},{"label":"other","text":"a friend gave my wife some pills that would increase the size of her breasts. is there such a thing? she is a 32 and believes these pills could make her 34 or a bit more.we are not talking huge here, just a noticeable difference.is it possible???"},{"label":"entertainment","text":"ANSWER i WANT TO SEE IF MINE IS WOSRSE? Whats the secret you have but haven't told anyone?\\n\\nI cant say my secret but I havent told anyone brcause i'm scared of what there reaction would be and how they would react \\n\\nSO WHATS YOURS???"},{"label":"science","text":"One molecule of glucose is used by heterotrophs to produce __________.? a. 2 ATP molecules. \\nb. 34 ATP molecules. \\nc. 36 ATP molecules. \\nd. 38 ATP molecules."},{"label":"science","text":"How do electrons move? "},{"label":"science","text":"How long can people go without water? "},{"label":"sport","text":"where can i find great bmx sponsors? "},{"label":"other","text":"Why do all questions that I post in religion and Christianity get erased? People are so incredibly lame.  They can't handle a little skepticism or doubt.  They automatically feel like they need to jump all over everyone who says anything that could be twisted and misconstrued to mean that they don't have faith in God.\\n\\nIf you can't question your faith, then how do you know the depth of your belief?"},{"label":"entertainment","text":"Song from Neon Genesis Evangelion - Death & Rebirth? What is the song used in the credits after Death?"},{"label":"sport","text":"Canseco , Bonds , Mcgwire? Lets Pretend all three of these guys are still playing . All three have 700 HRs or more . \\nWe all know the rumors and stories on the steroid issues with these guys . \\n\\nWho would baseball celebrate or honor for breaking the HR record ? Who would the fans be rooting for ? \\n\\nAnd if your first choice is Mcgwire ; doesnt race or ethnicity come to play here ? ( And dont tell me Mcgwire is clean ; if you think Bonds took Steroids why wouldnt you think Mcgwire did )"},{"label":"science","text":"what is an event horizon with regards to black holes? "},{"label":"entertainment","text":"can u help me? after gary puckett and the union gap, can anyone help? dont want to pay!"},{"label":"sport","text":"where do u see the us soccer team place at the world cup? "},{"label":"science","text":"verry important question? a particle is acted upon by a force of constant magnatude which is always perpendicular to the velocity of the particle.the motion of the particle is in a plane.it follows that [1]velocity is constant[2]accelaration is constant[3]kinetic energy is constant"},{"label":"sport","text":"Why does college basketball play halves instead of quarters and when did they change(used to use quarters)? "},{"label":"science","text":"why are capillaries from the circulatory system small and thin ? It is based on the circulatory system in your body."},{"label":"science","text":"On average,  which is colder, The North pole or the South Pole? My son has asked me this several times, and I don't know the answer.  Can any one help us out?"},{"label":"science","text":"f(x)=3x and g(x)=4x-3, find f[g(5)] and g[f(5)].? "},{"label":"science","text":"If light travels at 299,792,458 meters\/sec, then how fast does dark travels? I am just curious about it and I think it was an interesting question. =D"},{"label":"science","text":"What are some examples of changing species in evolution? "},{"label":"sport","text":"Le taureau espagnol dompté par des coups de becs  d un coq français????? C est inimaginable"},{"label":"sport","text":"Willy Sagnol Question? Who plays for France. I just read somwhere he is of North African Origin. I don't believe it. Does anyone know where in North Africa or is it just an internet error??"},{"label":"other","text":"What are the best methods to enhance libido? "},{"label":"science","text":"What is the tallest tree on the planet? "},{"label":"other","text":"What are the various virus detection tools? PLZ  ANSWER THE QUESTION POINT WISE AND GIVE DETAIL ABOUT EVERY POINT."},{"label":"other","text":"What is the meaning of the word diaro? I am looking for the meaning of the word diaro. I am doing some word study and cant find the meaning nor the origins of the word. \"\"Diaro\"\" Pleas help if you can."},{"label":"entertainment","text":"is anybody here a fan of yellowcard? "},{"label":"entertainment","text":"does anyone knows who sing a song bad of the heart not george lamond. im not sure if its the name  of the song he keeps saying bad of the heart. i heard it on latino mix when it used to be on, its a freestyle song..pls help thank u"},{"label":"sport","text":"have you ever heard about Nadia Comaneci? "},{"label":"other","text":"Should the president bring the troops back?? "},{"label":"sport","text":"Who else is ticked of that STEWART isent in the chase? i mean he is the best driver in the chase so far but he isent even in it!!!...isent the hole idea of the chase t5o sepporate the best driver from the rest?.....GO 20#, show everyone that you are the best and let them pity"},{"label":"other","text":"what would rather do like peanut butter off a hobos foot or be locked in a cage with a grizzly bear? "},{"label":"other","text":"how many words per minute do people speak? "},{"label":"other","text":"what is your proplem for joning? "},{"label":"other","text":"what is the website I can find who is congressional representative for 95818 Sacramento? "},{"label":"entertainment","text":"does anyone here have one of those mini-mtorcycles...like mini critch roket or mini chooper? i got a mini-crotch rocket and it is a blast...im 268 lbs and it gets up to 30-35 mph.man its a blast!!! if i ever wipe out on it i will diffinitely be in the hospital or dead!!!but it sure is fun!mine is an x-1.i really want one of those mini choppers but they are just to high right now...i got a good deal on mine,200.00 but it was basically brand new.the kid who sold it to me only rode it three times,and they normally go for 500.00,and the mini choppers are around 600-1000...but man i sure want one!"},{"label":"sport","text":"ESPN says that Kevin Garnett, Allen Iverson, maybe Jermaine Oneal are getting traded, where they going? Also are they any other player switching teams, and if so, where they going?"},{"label":"other","text":"When is the least fertile time for a girl? "},{"label":"science","text":"if mass was created by two higher dimensional branes colliding, what caused the higher dimensional branes? to exist?"},{"label":"entertainment","text":"Whats the OC theme song that goes \"\"california\"\"? At the start of the oc this song is played"},{"label":"other","text":"whats glanga fever? "},{"label":"other","text":"Which CPU is better for a notebook among 'AMD Turion 64 X2 Dual core' and 'Intel Core2Duo Mobile'? I am considering a 17\"\" notebook with a 2 GHz CPU, 2 GB of RAM, at least 256 MB (512 MB preffered) graphics card with GeForce 7600 or x1600 GPU. The DV9000 series notebooks match quite closely but I'm not sure if to go for DV9000Z (AMD CPU - $1950 approx.) or DV9000T (Intel CPU - $2250). The former is cheaper by about $300 with rest of the configuration remaining unchanged (except that it does not have the option for upgrading to 512 graphics card). Please suggest which of the two CPU choices should I go for and why. Also, if you know of any other manufacturer's offerings which have the same configuration, but a lower price-tag, please suggest me."},{"label":"other","text":"What Is SRCDATA Disk? trying to find nvatabus,sys file"},{"label":"entertainment","text":"Mississippi is a long word, how do you spell it? "},{"label":"science","text":"where is fresh water found? where is fresh water found?"},{"label":"other","text":"i am a distributor of a network marketing industry but find it very difficult to approach unknown people, help i hesitate approaching unknown people about the products or the business opportunity. i am confident of the results by using the products but by nature i am a little shy approaching people i dont know. please help"},{"label":"other","text":"when is the end of the world coming coz i want to be out? "},{"label":"sport","text":"Italian speaking people what does this sentence mean...? dottore de sto cazzo..quello che ti balla nel culo."},{"label":"science","text":"Can someone please explain e=mc^2 in plain simple english to me? "},{"label":"entertainment","text":"anyone know who sang the song used on ER comercial this week? Lokking for the halalua song used while the character Abby was at the crash site of the bus"},{"label":"entertainment","text":"Hey anyone know were to get cool songs at on a wabsite page? u can go to www.mp3search.ru its a good website but only one problem theydont have ALL the songs like bran new lol well ttyl and u can IM me anytime for more stuff ttyl byezzzzzzzzzzzz."},{"label":"other","text":"What do I do to reduce my fatness? I AM 15 AND 60  KG AND I THINK I AM NOT  PRETTY WITH THAT FATNESS.IHAVE TRIED EXERCISE BUT IT DOESNT WORK"},{"label":"other","text":"Why doesn't Yahoo! let u change ur ID? I am getting tired of my old Y! ID and would like a new one, but that means I would have to get a new account."},{"label":"sport","text":"WHO SHOULD BE MY FAVORITE TEAM THE BLUE JAYS OR THE DODGERs? "},{"label":"entertainment","text":"Slavery in the world? I've got a research on Slavery due tomorrow, plz help me, I'll send you something!"},{"label":"other","text":"We could not pay for a mobile home we financed...what happens next with the finance co? "},{"label":"science","text":"How are stars formed? "},{"label":"sport","text":"Who would your first five penalty takers be for England? "},{"label":"sport","text":"What Do You Think About Daisuke Matsuzaka?? I heard the Red Sox won the bid!!!!? I'm a huge Red Sox fan, so I'm thrilled about this, if it's really true. What do you think about it? Will it be good for the Red Sox? Are they paying too much money? And is it definite? If not, do you think he will come to Boston? Thanks!"},{"label":"entertainment","text":"fill in the blanks....      ------- is above God, if eat------- we will die.? it is a 7 letter word ...first to guess it correctly will b rewarded the 10 points.."},{"label":"other","text":"what is the home remedy to cure the cold of my 9 month old baby? "},{"label":"entertainment","text":"Why is Peter Jackson so good at making movies? "},{"label":"science","text":"what is the size of a cheek cell and an onion cell? this is for my bio lab homework. i can't find a web-site with the information so i was hoping that somebody could help me here."},{"label":"other","text":"Do you think the change of leadership in Great Britain  may change any policy for the better for Zimbabwe? It is widely viewed that Blair's foreign policy towards Zimbabwe has been hurting the ordinary person in Zim more than the intended target group.That is shear racism on the part of Blair toward the ordinary Zimbabwean populace.Besides what has that policy achieved since it was promoted all over Europe plus all other political gatherings that take place in Africa ta highest level."},{"label":"sport","text":"How do you feel about McNabb's injury? I don't think the Eagles are going anywhere now...\\n\\nwhat do you think?"},{"label":"sport","text":"Does anyone know of any pro wrestling schools in Indiana, specifically the Indianapolis area? "},{"label":"other","text":"How do you gain weight? My mom died 6 months ago I had stop eatin and lost my appetite for a while I used to way 145 now I weigh 130 somethin"},{"label":"science","text":"In angiosperms, where does photosynthesis take place? A. guarded cells\\nB. stomata\\nC. epidermal layer\\nD. palisade parenchyma\\nE. spongy parenchyma"},{"label":"other","text":"it is for an ethics project. i am a student at howrd university. of course i mean censored. but i can't even g "},{"label":"sport","text":"is there a free fantasy cricket site that is good? "},{"label":"sport","text":"I have a new pair of tall riding boots. is their a product that will help me break them in fast? "},{"label":"other","text":"were is the nicest place in the world? "},{"label":"entertainment","text":"Which is better, SG1 or Atlantis? ...and why"},{"label":"sport","text":"Whats up with the Dallas kicker, Mike Vanderjagt, I thought he was the MOST accurate kicker in the league? To me looks like maybe another T.O.\\n\\nOver hyped?"},{"label":"other","text":"hi again i want to know what is the brand of the video card of my hitachi loptop. windows 98 software. so goin "},{"label":"science","text":"which is larger in square miles, the state of texas or the country france? "},{"label":"entertainment","text":"do you know pig latin??? if you do write a pargrah long using ONLY pig latin..... have fun;)"},{"label":"other","text":"Can a company withhold your payroll check for any reason. please read on? i started working at menards about a month ago. i started on a thursday and worked that day that next friday and saturday. they pay bi-weekly so that was the end of the pay period. the HR guy said i might have a check but he couldnt promise that i would be on payroll in time. the check was suppose to come the week after i started. i didnt get one. so its been two weeks since i should ahve got the check, three and a couple days since i started. heres my problem. the HR guy said that i will be gettin the check from the first three days that i worked, or the first check i should ahve received. they wont combine that one with the one i should be getting for a whole two weeks. so ill be check behind until i dont work there anymore when then i will get one for the last two weeks of my employment. WHAT IM ASKING IS CAN THEY WITHHOLD MY CHECK FOR EXTRA TIME LIKE THAT???"},{"label":"other","text":"how many people a year are affected by sexualy transmitted disease? "},{"label":"entertainment","text":"where can I get a free astrological chart done? "},{"label":"entertainment","text":"which mission is most impossible James bond, Ethan hunt or macgyver mission? "},{"label":"sport","text":"where can i download sports torrents especially cricket? I am looking to download cricket highlights and so on from bittorrent sites. can anybody suggest some sites please?\\n\\nthank u \\n\\nmik"},{"label":"science","text":"can you call for me acivil engineer? in hydrulik structur"},{"label":"other","text":"PC\/Emulator help!!!!!!!!!!!!!!!? ok so i have asked before about emulators for old NES games and such and the directions ppl give me are for someone who has already used such a thing...i have never used and emulator and i would like someone to tell me where can i get one\/ how do i use it\/ and how to install it\\n\\nI need the directions to be as simple as possible, u could say i am completely clueless on the subject\\n\\nRemember easy directions!!!"},{"label":"other","text":"Where can I find scholarly journals about this question....Does gender make a difference in job stress? "},{"label":"science","text":"nobody has ownership of outerspace right, not even NASA.if you have the ability to launch a sattelite, can you "},{"label":"science","text":"Computer disks work on the principles of electricity and magnetism.Determinehow magnetic signals are converted Computer disks work on the principles of electricity and magnetism.Determine how magnetic signals are converted to electric impulses"},{"label":"science","text":"Why have have we not been contacted by et's yet? "},{"label":"entertainment","text":"Has ne one ever been to Washington D.C?? im goin there wit my school on thursday and i have to go to the arlington national cemetery...if uve been there...was it fun!?!?"},{"label":"sport","text":"Can white men really not jump...or are they just too lazy to jump? It seems as though the Europeans jump fine. "},{"label":"sport","text":"england the winners? reality or unrealistic wishes? "},{"label":"science","text":"How is smell is propagated in air ? Odour is propagated throgh a medium, but how it is transmitted is not known. The atoms from the source to the detector may be the clue."},{"label":"other","text":"Why Has God Createth Me? christians are jealous of my beauty"},{"label":"entertainment","text":"who is sick of American idol? "},{"label":"science","text":"balancing question? I am having problems balancing this \\nKI+HNO3=KNO3+NO+I2+H2O"},{"label":"other","text":"Where is the address book on this verizon-yahoo beta system? "},{"label":"sport","text":"c'est quoi une relation sentimentale? sentimentalite veux dire quoi?"},{"label":"entertainment","text":"The BTK killer now has TV privileges, will he watch Prison Break? "},{"label":"science","text":"Was The Montauk Project On Time Travel, Hyperspace Etc., For Real? "},{"label":"science","text":"How do you put the equation -2y=-2x+4 into slope intercept form? Thanks so much\\n-Ben"},{"label":"entertainment","text":"guitar lessons in drogheda? could anyone tell me where i could get some 1 on 1 guitar lesons in drogheda. i tried in a group before but got too busy with work and had to quit. am going to oz in a few months and would like to learn a few sons before i go"},{"label":"sport","text":"do you ladies know the word golf means gentlemen only ladies forbidden  FACT? i think this game should revert back to men only women are only in the way on the golf course"},{"label":"sport","text":"what do u do when your friend and her mom might not go to an basketball game? please i need it today so email? please help me before 6"},{"label":"other","text":"what were pediatrician wages in 1960? "},{"label":"other","text":"are you happy??? french and italian people grabbed pesty azzurri zombie and cut him to many pieces then  donate to german mad scientist named Dr Frankstein...he took azzurri zombie's mangled  parts for his project... few days later ,he finished with his his project...then you guys found out that he forgot to turn off cloning machine project ...so here is trillions of  azzurri men running loose now...."},{"label":"sport","text":"Other than Brazil, who has the best chance to win this year's world cup? "},{"label":"entertainment","text":"Matt Lauer or Anderson Cooper? "},{"label":"sport","text":"Which player from the 06 draft will be the biggest flop in the NFL.? Leinhart, Bush, Mario Williams, Cutler, You decide"},{"label":"entertainment","text":"Any body like The Rock? "},{"label":"other","text":"Iam building a website for a Real Estate company with Flash elements how much should i bid the job at? "},{"label":"science","text":"How many mil thick is the standard plastic 'to go' containger? "},{"label":"entertainment","text":"if u are a miley cyrus fan? click here!? http:\/\/groups.yahoo.com\/group\/mileycyrusworld\/"},{"label":"entertainment","text":"What is your favorite TV show??? Mine is Spongebob Squarepants and Drake and Josh. Drake Bell is HOT!"},{"label":"entertainment","text":"Best Blonde Joke? Best one gets 10 wopping points"},{"label":"other","text":"What are the other names for INDIA? "},{"label":"other","text":"How can you love someone so much it hurts? "},{"label":"other","text":"Do you think a woman could win the U.S. Presidency? It seems like Hillary Clinton may be the Democrat's top choice for the 2008 election.  There has never been a female president so I wonder if she could win."},{"label":"other","text":"how to make paint from natural sources? "},{"label":"sport","text":"who should I start at QB? C.Palmer against Balrimore D or C.Pennington against G.B...\\nIts good qb against good D...or banged up qb against bad D"},{"label":"sport","text":"Any results in the ufc fights in sacremento? any fights  would be nice to know about any updates"},{"label":"other","text":"I have a Little Tummy, how to reduce this. If tummy is reduced, I will lokk 10 year younger, how to reduce ?? "},{"label":"sport","text":"why dosen\"\"t any one talk sports? "},{"label":"other","text":"Can I get a prosecutor fired for being unprofessional and not acting p.c.? I had to go to court today and got some unfortuate news which at was not as bad as I thought. I got pulled over last December because I wasn't wearing a seat belt (hello! I was going through a check point! Shouldn't they be worried about drunks?) And I was late paying my car insurance by three weeks and my insurance company called the bmv and told them I was late so they suspended my licsense! I renewed my licsense that night and went downtown and paid a $200 reinstatement fee then I went to court and  paid $260 in court costs. As far as I knew I had my liscense back and everything was cool. Then in March I was really upset because a family member owed me money and he said he would bring it over, never came over and wasn't picking up his phone. Furious, I drove to his house and was going about 65 in a 40 on an inconspicous country road. A cop coming the oppisite direction sees me and turns around and pulls me over. He comes back and tells me my licsense is suspended! I guess even"},{"label":"other","text":"If you quit a job in california, and do not give 2 weeks notice, can the employer give you a bad refrence? "},{"label":"sport","text":"Solenoid or starter? I am about to replace the starter of a 1988 chevy cavalier.  How can I tell if it is the solenoid or the starter?"},{"label":"sport","text":"How do the NBA finals have like many final games? Im not really a fan and I jus dont understand how it works"},{"label":"sport","text":"is there an online price guide for collecter cards? "},{"label":"other","text":"how can women not know who is the father of there baby,i watch the maury polvich show and some women bring ten men sometimes and still can not find the father"},{"label":"other","text":"does the word \"\"gig\"\" also mean deal or things? i've always associated the word with musician's gig.. like their temp job.. but today someone said I didn't get the V.P.gig.. and it sounded like he meant a deal.  is that right?"},{"label":"entertainment","text":"FOUR is HALF of FIVE.Is this statement True or False? "},{"label":"sport","text":"What Professional Coaches have never played the sport, they are coaching? "},{"label":"sport","text":"who likes the BLUE JACKETS i do? im in columbus so duh i like the jackets"},{"label":"sport","text":"Duke Lacrosse.....? Who's Lying - the players or the \"\"dancer\"\"?"},{"label":"other","text":"What percentage of democrats are pretending? to believe kerry botched a joke because they can't admit when a democrat does something wrong,,   and what percent actually believe the lame excuse given a day later?"},{"label":"entertainment","text":"Does anyone know what restaurants in London or the UK have featured in films or on TV? So far I have: \\n\\nThe National Portrait Gallery restaurant was used in 'Closer'. The Brasserie Max at the Covent Garden Hotel was used in 'Match Point', Oriel in Sloane Square was in Four Weddings and a Funeral, also Bertorellis in Charlotte St featured in Sliding Doors... \\n\\nany more?"},{"label":"science","text":"What should I major in? I love math! Its my favorite subject. Im in the chess club,Math team, Drum and Bugle corp. I am at the top of my sophomore class, with class rank of number 1. I am very confused because I should start looking at colleges by now , But im not sure what I should look for because I think it should all depend on what I want to major in. I was thinking about an Ivy leaghe school or something like that, Even though I think thatthere is litte possiblity of me gettin in to an ivy league school but I will sure try."},{"label":"sport","text":"Im 14 years old and looking for a job.? I will like to find a teeage job for the summer."},{"label":"sport","text":"girl skateborders? one of my friends is a girl and she skateboards but her parents say it is not right for girls to skateboard so wat should she do ?"},{"label":"other","text":"Why does cold air make my nose run? All I have to do is feel a slightly cool draft on my face an my nose runs! Why is that?"},{"label":"other","text":"Is a St. Christopher medal necklace too boyish? I am getting married in August we both have children (him a 7 year old boy, me a 8 year old girl).  We are getting them both a gift when we get married.  We are pretty religious and was thinking a St Christopher medal would be a really nice gift that they can keep into adulthood, with their name and our wedding date engraved on back.  I want to get them the same thing or similar in idea.  Is a St. Christopher medal necklace too boyish for my 8 year old daughter as a gift to her on our wedding day?  We though about a cross for my daughter but not enough room to engrave her name and the date on it.  Any ideas?"},{"label":"other","text":"My friend who is a guy...........? I have this guy who's like my best friend. He just moved here this year in August from New York. First he likes this really popular girl. THen all of a sudden he tried to go out with another girl because the first one dumped him on Valentines day. I told him he was trying to go out with the second girl for all the wrong reasons. He still liked the first girl who dumped him and he's been tryin to see what she thinks of him. On monday he was still liked obsessed with her, but it was fine with me. He liked her a lot. He finds out that another girl in our class likes him because the girl that 1st dumped him kept asking him what he thought of this other girl Charlie. He told her that she was ok. Then he finds out Charlie want to go out with him. HE says he will, but Charlie was gonna ask him after skool. I passed a note to him and he says that he remembers he liked her at the begginning of the year, so he will go out with her. Charlie asks him out and he says yes............................"},{"label":"entertainment","text":"who killed selena? where did she get shot. give info plez and websites thnx"},{"label":"science","text":"What is molten sulfer used for? "},{"label":"science","text":"What does a portable gamma-ray spectrometer cost? I want to measure K in soil."},{"label":"sport","text":"what happened to terry wogan after euro 96 does he have another job? "},{"label":"science","text":"When viewed from the Southern Hemisphere, is the Moon upside down? I look up at the Moon from my home in Scotland and see it as it has always looked to people here, in the Northern Hemisphere. But if I was in the Southern Hemisphere and looked at the Moon, would it look the same, or Upside Down.\\nI guess the same question could be asked in reverse by someone \"\"Down Under\"\" :-D"},{"label":"other","text":"Howcome the past always seems better? I mean no matter what I do or think the past is always better...am I right or wrong?"},{"label":"sport","text":"information about soccer agents in kuwait, like websites? "},{"label":"other","text":"On a first date would you rather go to an upscale, 'fancy' restaurant or something more laid back and relaxed? "},{"label":"other","text":"Why is XML so important. It is useless for data representation and organization? "},{"label":"science","text":"Are carbon dioxide (Co2) lasers safe? How can I build a mini-Co2 lasre myself? (show me a schema)? "},{"label":"entertainment","text":"Whatever happened to Jonathon Gilbert who played Willie Nelson on Little House on the Prairie? "},{"label":"science","text":"Algebra Question? How woulg you graph y = | 3 - y |\\n(ABSOLUTE VALUE)\\n\\nHow would you get \"\"y=\"\" form for :                x = | 3 - y| and x = y"},{"label":"entertainment","text":"I was driving home from work and heard a cover of \"\"Day by Day\"\" by DC Talk on a hard rock station. Who did it? "},{"label":"entertainment","text":"who is the artist of the spanish guitar jazz bailet? "},{"label":"science","text":"DNA-RNA Hybrid Complex? What is it?"},{"label":"entertainment","text":"If you were casting actors & actresses for a ZELDA film, whom would you choose for which part? I know one thing for sure. Emma Watson is definitely my Zelda. And somehow, Johnny Depp would end up in the film.\\n\\nAlso... do tell if you're thinking of a specific Zelda game."},{"label":"entertainment","text":"Where is a site that will teach me how to learn power tabs for free? "},{"label":"entertainment","text":"How much work per day does your boss really get out of you? 100% of your time? 50%? \\nHow many hours while you're at work do you actually spend working? On average.\\n\\nToday was a bad day for me but normally I'd say about 90%."},{"label":"sport","text":"What is the smallest breed of horses? "},{"label":"science","text":"dilution formula is M1V1=M2V2. So how does it help u when u go into food tech studies? "},{"label":"entertainment","text":"In the movie Ferris Buler's Day Off, what is the song that he sings on the float before \"\"Twist and Shout\"\"? "},{"label":"sport","text":"What NBA team pennant do I have hanging in my room right now? First correct answer wins the points!? "},{"label":"entertainment","text":"Prison Break???? Anyone know when the next seaon of Prison Break will start? Just seen the last episode of season 1 and I'm busting to see more, I'm assuming there will be a season 2??"},{"label":"science","text":"sigma i= 1 to 15  [(i^2-2i)\/n].....find the sum using the summation formulas? please do this in detail becasue i need help with this concept thnx"},{"label":"other","text":"what does it mean when a woman reaches over and takes food off man plate, without asking in restraunt setting? they are \"\"just friends"},{"label":"science","text":"what is the difference between the two brand (bayer &federated pharmaceutical) which makes asprin? i need the diffence in concentration if any one is stronger and what is the chemical build up of these asprin (i need answer A.S.A.P lab crisis)"},{"label":"entertainment","text":"Who is your favourite celebrity and why ? The best answer wins 10 points...."},{"label":"sport","text":"do you play hockey? i knnow you really suck at it so dont play it any more! HAHA"},{"label":"science","text":"Explain the process of genetic recombination or gene splicing.? Explain the process of genetic recombination or gene splicing."},{"label":"sport","text":"is there any 2 square competitions in australia??? "},{"label":"science","text":"Express as a table:{(2,3),(1,-3),(10,11)? "},{"label":"science","text":"What time is 5am to 12pm pacific in eastern time? "},{"label":"other","text":"Why Women Feet are very very very attractive to Men and Sometimes Women too? "},{"label":"other","text":"pls help me? my boyfriend got drunk last weekend, and he told me that before me had dozens and tyhousands of girls, not only that, that he is also doing the same. i asked him again, and he said yes, and was proud of it. he told me i am proud of doing so, and when i got angry he told me don't get angry because i hate it. would you believe what he did? he was drunk when he told me so."},{"label":"other","text":"Can someone make me a DX avatar? I need a DX avatar to put on myspace just cause I wanna. Many thanks in advance! Break it down!"},{"label":"other","text":"im bulimic and havent had my period since nov.04, will birth control pills make it start again? and also do they make u gain weight?"},{"label":"entertainment","text":"What will be the next video format: Blu-Ray or HD-DVD? Personally i hope Blu-Ray will be the next big thing because of its higher capacity then HD-DVD. And since the PS3 will be shipped with a B-R player it will probally capture a large part of the market."},{"label":"science","text":"is liquid nitrogen or liquid oxygen colder? "},{"label":"sport","text":"london wasps? "},{"label":"entertainment","text":"what are five things that contributed to film as we know it today? "},{"label":"sport","text":"Mexico O-O Angola whose fault is it?  the Mexican players or the Mexican coach? "},{"label":"sport","text":"New York Football Giants lose tonight, can you give me reason why not to give hope on the season? Ok the team is hurting - lots of injuries.  We didn't play that bad really, for an injured team.  The rest of schedule isn't too bad.  Should I keep hope alive the season isn't all for not?"},{"label":"science","text":"Which medium will speed of sound be greater? vacuum, atmosphere on mars, Ind Ocean @ 200 ft, door of  Bkvault? This question is asked in a physical science class -- last part of question refers to the door of a bank vault."},{"label":"entertainment","text":"who thinks GGGG_unit is da best? "},{"label":"sport","text":"What are the rules for an onside kick? "},{"label":"science","text":"why is cold water has more oxygen than hot water? "},{"label":"sport","text":"how many player christan name and surname started with the same letter who played for coventry city.? "},{"label":"sport","text":"need to get spec. for building a few holes par3to4 to use on apx 20 arce hobby farm. yardage and green sizes.? building of greens,fairways,right and left how wide and long etc."},{"label":"entertainment","text":"I was offered a job in Haward, California. Where would you live if you are person that enjoys going to the ... movies, coffee bars and night life. I can't live in SF because it is far away. I don't have a car either."},{"label":"science","text":"What is \"\"Daylight Savings Time\"\" ? "},{"label":"science","text":"Can you solve this??? hose #1 can fill a swimming pool in 6 hours. hose #2 can fill the same pool in 2 hours. hose #3 is identical to hose #1. if all three hoses are used to fill a pool, how long would it take?\\n\\nexplain."},{"label":"science","text":"find the largest integral value of k in kx squared  - 5x + 3=0? "},{"label":"entertainment","text":"what is your favorite ice cream flavor..? me-chocolate!"},{"label":"sport","text":"I want the results of all World's Strongest man contests dating back to 1977? Why is that so hard? "},{"label":"entertainment","text":"What's the most annoying song ever? For me, it's Love Shack by the B-52's"},{"label":"science","text":"Please prove: (-a)b = -(ab); (-1)b = -b. Please use axioms only? Please, also prove this: (-a)(-b) = ab. Again, please use axioms... Thanx a lot..."},{"label":"science","text":"why does petrol stains on the road show rainbow colours after rain? which scientific principle works here?"},{"label":"entertainment","text":"Can you believe what happened on LOST last night? I was totally shocked.  What do think is going on?"},{"label":"entertainment","text":"Please Read!!? What Is This Song Called? It Goes Like This:\\nWoop! There It Is! Woop! There It Is!!\\n\\nsomething like that."},{"label":"other","text":"does anyone know a free music download website that my computer wont get a virus from? plz i need this"},{"label":"sport","text":"Should any Mlb records before integration be recognized? "},{"label":"science","text":"i'm 16 years old and i dont know what 2*2 is can u help me? in mathematics"},{"label":"sport","text":"what kind of sports RU into? "},{"label":"sport","text":"What cups \/ titles have manchester united won this year? i have been quite confused by all the cups and titles... the ones i know are FA Cup, Champions League, EPL.. but which are the ones man u participate in and have they won any cups\/ titles this year or last year?"},{"label":"entertainment","text":"does anyone know where you can find some good seventies and eighties commercials? me and my hubby love wactching these old commercials any sort of web sites would be helpfull thank you."},{"label":"sport","text":"How do i lay down a good tackle in football and how do i block a kid bigger than me? Only answer if you have played"},{"label":"sport","text":"u ca have 10 pts.if u answer is correct.? how many eggs&milk does great khali eat &drink."},{"label":"sport","text":"who are your favorite NFL team? My favorite teams are indianapolis colts, and new england patriots."},{"label":"other","text":"What is the only mammal on earth that can't jump straight up in the air from a standing position? "},{"label":"science","text":"Graph the function? f(x)=x(sq)-2x+5"},{"label":"other","text":"What would happen? If native Americans dicided to reomove al whites to reservation camps just to get back, how many of you would hide, claiming to be another race.\"\"no don't take me, my familiy is Italian\"\" or \"\"Please don't take me I'll work for minimum wage\"\" not funny right? But of course that will never happen since the natives were put on reservations because you all where scared shitless when they where running around Killing all the settlers!  And even if there are anchor babies born in this country, I guess that at one piont we all were the anchor babies. who care about illegals let the government deal with it."},{"label":"science","text":"Which is the deepest known lake in the world? "},{"label":"sport","text":"last 5 centuries scored by tendulkar - when and where? "},{"label":"science","text":"socket programing in delphi? program for client & server"},{"label":"science","text":"explian what happens if you tilt your forceps either up or down during alcohol-flaming? tell me faster pls.? "},{"label":"entertainment","text":"Has anyone seen the children's movie \"\"Cars\"\"? "},{"label":"science","text":"What does the x in xray mean? My 12 year old son asked this question while in the xray department and no one could tell him - does anyone know?"},{"label":"science","text":"1st Post :) Need Help finding a formual? Alright..Story problem consists of building a path of blocks 1 ft. by 2 ft. The ending path should be 20 feet long, but with the rectangular blocks, [may need to draw picture] you can put them widthwise (makes path 1 foot longer, while still being 2 feet wide) OR lengthwise (two blocks together, also making the path 2 feet wide, but is now 2 feet long.) The goal is to see how many different combinations you can make for 20 ft. path. You make a X,Y table, (X rep. the length of the path in feet, and Y is the number of combos you can make with the blocks) So..X: 1,2,3,4,5,6,7..etc. While Y:1,2,3,5,8,13,21,55,76 (you can se the pattern is adding the first 2 y values to get the third EX 1+2=3; 3+5=8 ..ETC.) Now the hard part is finding a working formula where you can take ANY X value and plug it in to get the correct value of Y...So far all i've seen is that the area of the path is 2(x) and that the X value is the number of blocks used in the combination..any ideas for a FORMULA? THANK YOU!"},{"label":"science","text":"find the area between y=cos x and y = sin 2x on the interval of  0 <= x <= pi\/2? "},{"label":"science","text":"Can a jet plane fly out of earth's orbit? Since space starts about 100 km..."},{"label":"other","text":"which language? Should I learn french or spanish, or what other language??"},{"label":"science","text":"In the design of nonstandard, semi permanent fixed highway bridges, the weight of the bridge itself to include "},{"label":"science","text":"Does Anyone know Who ACTUALLY Invented the Electric Dimmer Switch?And When? "},{"label":"science","text":"what are roles of organic matter in petroleum generation? "},{"label":"science","text":"is it normal for women to have a sort of adam's apple? "},{"label":"science","text":"what do you call a group of mountains? "},{"label":"entertainment","text":"Where has Neil Bentley gone? "},{"label":"science","text":"How can I increase my memory? I want to be able to instantly take in my surroundings and draw inferences from pertinant information, or open the fridge for a couple seconds, close it, and be able to tell not only what was in it, but how many, the brand, etc..... can this be self taught or do i need to be rain man?"},{"label":"other","text":"How much life insurance? Married, no kids, will buy a house next year, anuual income = about 80K\\n\\nOptions:\\n\\n1x annual salary - free\\n2 x - $9.44\/month\\n3 x - $18.88\/moth\\n4 x $8.32\/month\\n5 x $37.76\/month\\n\\nAlso, should I bother w\/spouse insurance (about $5\/month?)"},{"label":"sport","text":"Why did the Spurs lose to the Mavs? "},{"label":"science","text":"Why do I have to learn trigonometry? "},{"label":"entertainment","text":"What is Tool's song \"\"Eulogy\"\" really about? When I first listened to it, I thought it was about Jesus Christ, but I've heard other interpretations: that it's about martyers in general, evangelists, Maynard James Keenan's experience in the military, and L. Ron Hubbard."},{"label":"other","text":"How can OJ's $33million retirement fund be off limits as recompense to the Goldman family? What was the intent of the law that protects retirement funds off limits to legal penalties?  I can understand not wanting to have indigent cons and ex-cons.  But it seems like you could accomplish that by saying the first 2 or 3 million dollars is off limits to legal action.  But $33 million??!!  OJ rakes in $25k a month!"},{"label":"entertainment","text":"JLO slept with me in 69 position whole throught the night yesterday? in my dream.what do I do now?"},{"label":"science","text":"Does the oxygen produced by photosynthesis follow a diurnal pattern? Is there more oxygen in the morning?"},{"label":"other","text":"If tax cuts work to raise tax revenues why do we have such a large deficit after so many of them.? And please don't say because we increased spending.  Remember the Republican have been in power since Clinton's time."},{"label":"other","text":"Safe to eat seeds? I like to eat cherries, but instead of spitting the seed out, I like to swallow the seeds. I feel like it would help my digestive system out, give it roughage and fill me up better.\\n\\nIs it safe for me to do this?\\n\\nAren't fruits designed to be eaten and digested by humans, including the seeds?"},{"label":"other","text":"What can I do to get my family to come togther as a family? "},{"label":"entertainment","text":"hoow many peopelare emo??? just want to no so emo people"},{"label":"entertainment","text":"Here fubar movie genius here's one for you (and all other film genii)? Who said the poison from the pellet is in the pestle from the vessle it's the chalice from the palace that's the brew that is true...and in what film"},{"label":"other","text":"Does anyone know anything about Ken Roberts TOVI?? "},{"label":"sport","text":"How many of you thought It was Jeff Jarret that attacked Sting from behind instead Tyson Tomko on Impact? I thought it was until he reavealed himself"},{"label":"entertainment","text":"Anyone heard of \"\"She wants revenge\"\"? It's a great band."},{"label":"science","text":"What is Vulcan XC? I see this word when people use Platinum supported on Vulcan XC-72 to make catalyst for fuel cell."},{"label":"entertainment","text":"are you a above-average driver or below-average driver? "},{"label":"sport","text":"Do you wear underwear with bike shorts? i don't know if i should wear underwear with the spandex shorts or not"},{"label":"sport","text":"Do real men play rugby and steroid wimps play American Football? "},{"label":"science","text":"why are bee's attracted to bright colored flowers instead of white flowers? "},{"label":"science","text":"How cold does it have to be outside before you can see your own breath? The question is pretty much self explanitory."},{"label":"sport","text":"Who's better Dale Jr. or Jimmie Johnson? Okay Okay! Personally I'm a Jr. Fan but I'm looking for opinions. Who's the better Racer? Dale Jr. Or Jimmie Johnson. And if you think niether.... Who do pick and why?"},{"label":"sport","text":"how does one clean a shotgun properly? "},{"label":"entertainment","text":"anyone a Dillinger Escape Plan fan ? DEP is a combonation of Jazz time signatures and scales with a Hardcore\/Heavy Metal sound to it. It's really chaotic stuff but it takes tremendous talent to play any of their stuff on any instrument. I was just wondering if anyone out there is a fan of them ? They seem to have a small following b\/c of their sound and lack of publicity. Also , for any musicians out there : do you think that using a Jazz meter for Metal music is theoretically sound and usable for other genres ? Ex: Industrial Metal + Jazz = Jazz industrial."},{"label":"sport","text":"Trade Droughns for Branch? My RB's are: LJ, Lundy, Maroney, Norwood and Droughns.  I have been offered Deion Branch for Droughns.  I could use a decent WR to stash on the bench in the event something happens to one of my studs.  Take the deal?  Thanks!"},{"label":"sport","text":"who was the Denver Broncos Quarterback in 1982 and 1981 and 1983? "},{"label":"entertainment","text":"Do you know? When the sky beings to snow you cry?"},{"label":"other","text":"How many people would consider themselves a Bible believer?? And why??  \\nAlso do you try to live by it?"},{"label":"sport","text":"What do I do if it rains on my party? "},{"label":"science","text":"do males or female have a better sense of smell? please show references of the websites thanks"},{"label":"sport","text":"will the giants loose 100 games? enough with the Bonds nonsence is the Giants going to lose 100 games bottom line?"},{"label":"entertainment","text":"what ever happened to cathy dennis , she was hot? her video for touch me all night long was hottt"},{"label":"science","text":"Why does wet blossom smell like come? Spoils a good walk."},{"label":"other","text":"where can i find a website that list all types of scholarships? "},{"label":"entertainment","text":"Know any \"\"Gentelmen's Clubs\"\" (strip clubs) in the Baltimore\/DC area? Which ones have you been too, what did you think?  Which ones were the classiest?"},{"label":"sport","text":"Which Heisman trophy winners are or have been college football coaches? "},{"label":"sport","text":"Who Is The Best Rapper in the NBA? "},{"label":"other","text":"what does rare mean? "},{"label":"science","text":"can you help...i need to know how deep a submarine can dive before it implodes? submarines"},{"label":"science","text":"What is the difference between a monsoon and a typhoon? "},{"label":"science","text":"what would be a good science fair topic for my project? "},{"label":"science","text":"What is Fermats theory, and Harmdats theory? can anyone give me the rudiments please"},{"label":"other","text":"For finding the ith order statistic, prove that the average case complexity when random method is used is o(n) "},{"label":"science","text":"How do people get the ships inside of a bottle ? I always wondered how."},{"label":"other","text":"computer booting with wrong CPU speed? On a irregular basis my computer fails to boot due to an incorrect cpu speed and I have to reset the bios before I can proceed. I was thinking the cause maybe a low battery on the mainboard, any Ideas?"},{"label":"entertainment","text":"What is the name of this song (sound clip provided)? http:\/\/content.ytmnd.com\/content\/c\/b\/1\/cb1ae562778d8639faaa72dfd5099704.mp3"},{"label":"science","text":"The moment someone dies and they die with their eyes open, can they still see momentarily? "},{"label":"sport","text":"Which player at this year's world cup will win the golden boot? "},{"label":"science","text":"Can you explain to me the concept of the universe being a vacuum? "},{"label":"sport","text":"Does anyone know where the All Blacks are staying when they are in Brisbane on the 29 July? "},{"label":"entertainment","text":"4 categories of ethnic instruments? please answer it"},{"label":"sport","text":"What is ment when someone says, \"\"It's not the Xs and Os, it's the Jimmys and Joes?\"\"? "},{"label":"other","text":"If  Asians and Indians have different faces..................? If Asians and Indians have different faces, the word 'Asian' is wrong as India is also a part of Asia.\\n\\nAlso when they say Asian girls and Asian guys, does that include Indians?\\nI am not really sure of this, my girlfriend is from India, technically she is Asian, as India is a part of Asia. So she is Asian, right?\\n\\nP.S - The Indians from India"},{"label":"sport","text":"WHo is the best basketball player in the NBA? "},{"label":"sport","text":"who will win cricket world cup2007? "},{"label":"sport","text":"What team has the most points in World Cup right now? I think its Germany,but who else does? And who has the most chance to win the World Cup???"},{"label":"science","text":"find pH, help? A solution is prepared by adding 48.8 mL of concentrated hydrochloric acid and 17.5 mL of concentrated nitric acid to 300 mL of water. More water is added until the final volume is 1.00 L. Calculate [H+], [OH -], and the pH for this solution. [Hint: Concentrated HCl is 38% HCl (by mass) and has a density of 1.19 g\/mL; concentrated HNO3 is 70.% HNO3 and has a density of 1.42 g\/mL.] \\nhow do i find pH"},{"label":"sport","text":"quel est le meilleur hameçon  ; le plus lèger et le plus solide possible pour la pêche de la brème? les brèmes pesent entre 1 et 2 kg"},{"label":"sport","text":"What two teams will be in world cup final? "},{"label":"sport","text":"Where does kick-boxing rank in popularity as a sport? "},{"label":"other","text":"Does any one has an inspirational quote? I mean for doing homework or keeping track of things etc.? "},{"label":"science","text":"Mean is $20273 and Stan. Deviation is $4100.  For 100 Colleges? What is the probability that the mean tuition of the sample is within $410 of the population mean?"},{"label":"other","text":"Why are some guys jerks? "},{"label":"entertainment","text":"how many Disney movies in all are there? "},{"label":"sport","text":"whem is the best time to start fresh-water fishing in the boston-ma area? for anthin bass trout etc....? i have several ponds and stuff in town but no bites yet and whats the best equipment for early season?"},{"label":"science","text":"what are the importan sources and uses of organic compounds in the different fields(medicine,industrual etc.)? PLS  I NID UR HELP!\\nTNX A LOT"},{"label":"science","text":"how do u put a hole in a quater? "},{"label":"entertainment","text":"who sings the song blue bayou? "},{"label":"science","text":"which is the most largest sandy desert? Gobi, Sahara, Mojave"},{"label":"sport","text":"can we put the cocking oil on horse feed for make them more powerful? "},{"label":"other","text":"I am 17 years older than my partner; is this really a problem? "},{"label":"science","text":"what color is the sky in california? 1st  ?"},{"label":"entertainment","text":"Who is the artist of the song \"\"I always feel like\"\" in Rock-type? I know that the original one is by rockwell and there's a one by Master P...but I heard one that is rock-type...could u give me infos about it?"},{"label":"entertainment","text":"When copying info from a computer to a disk, what's the difference from a CD and DVD? \"\"R\"\" and \"\"RW\"\"? "},{"label":"sport","text":"Who's the youngest skip ever to win the Brier(Canadian Men's Curling Championship)? "},{"label":"sport","text":"What will be the top 5 Picks be in the NFL Draft? "},{"label":"science","text":"With today's satellite technology, is it believed that uncharted islands still exist? "},{"label":"sport","text":"Was there a winner in super bowl xl? because it didn't seem like it.i know the steelers won but the refs made them win"},{"label":"science","text":"What makes stream water so clear in the fall? "},{"label":"sport","text":"what year did foinhaven win the grand national and who rode him? "},{"label":"sport","text":"how much money did each player get for winning stanley cup? "},{"label":"science","text":"does oil replace its self as fast as it is taken?is it hollow space? "},{"label":"other","text":"what is the only state bounded by two oceans? "},{"label":"sport","text":"What is the difference among the college football Bowl games? What is the difference between the different Bowl games in college football?  Who decides which teams go to each bowl?  How are these teams decided?  What is the most prestigious bowl game?"},{"label":"entertainment","text":"Your opinion on United 93? What do think about it, good movie or propaganda? or just to early?"},{"label":"sport","text":"How does the NFL superbowl tickets lottery works. How do I apply for the lottery.? "},{"label":"other","text":"downloading off youtube? what program can i download so i can download off of youtube?"},{"label":"other","text":"To knowledgeable Australians, is Sir Leslie......? I saw Sir Leslie Colin Patterson on a late show last night. Is he gay?\\nPuzzled, Rose P."},{"label":"science","text":"can someone tell me about catalase and H2O2? "},{"label":"entertainment","text":"I want to get into spider man comics,are the essential collections a good start? "},{"label":"other","text":"i m in med ??? "},{"label":"science","text":"Are alligators and crocodiles equally deadly? "},{"label":"entertainment","text":"What is your favorite song\/songs? Name a few songs"},{"label":"sport","text":"What racquets are better? Head, Prince, Wilson, or Babolat? "},{"label":"science","text":"What is the LCM of 16 and 60?? "},{"label":"other","text":"When do you think you can find your true love? "},{"label":"sport","text":"MLB,NBA,NFL,NCAA teams have home team in white. Why does NHL reverse this? "},{"label":"other","text":"I was bisexual before I got married-now I want to have a girlfriend, what should I do? My husband is ok w\/it? My husband says he understands and wants me to be happy. How do I find a new \"\"friend\"\"?"},{"label":"sport","text":"looking for gary yamamoto splashII top water poppers. Already looked on e-bay. please help!!!? "},{"label":"other","text":"Who is republican's most likely candidate for 2008 elections? Who is the republican party of the United States most likely candidate for the presidential election. A lot of people say Condi, but I'm not sure that republicans would put a women up for election...\\n\\nSenator McCain also seems a \"\"likely choice\"\" what is you're thoughts?"},{"label":"sport","text":"predict the score barca v arsenal? "},{"label":"other","text":"Birth Control? I just started Ortho Tri Cyclen Lo a month ago, and I just started my first period after taking it....will the pill affect it at all? What are the benefits of taking the pill when it comes to your period?? Thanks :)"},{"label":"other","text":"where can i buy STUN GUNS and TAZERS GUNS? i don't want to shop online. also, do i need to be over 21 and need some kind of licence to purshase it?\\nneeds to be around sacramento area."},{"label":"entertainment","text":"Have you ever produced the 'Wind that shook the barley'? I am not refereing to the controversial Ken Loach film depicting the history of the English Black & Tans in Ireland in the early part of the century, and the formation of the IRA.\\n\\nRather, An air biscuit so strong that it blows all one's a*rse cress in the same direction, creating the appearance of a dark Irish wheat field in one's cleft.\\n\\nThis may not apply to all the girls on this website admittedly...but certainly some of them..."},{"label":"sport","text":"Ab training? How often should you do abs? What is a good workout or what some good exercises to build up the abdominal muscles? For the upper, lower, and side abs?"},{"label":"science","text":"Have someone a camera lucida for Carl Zeiss Steremicroscope ? "},{"label":"entertainment","text":"whats do you think is the most pathetic, ridiculous even stupid Question(s)asked in yahoo answers?????? "},{"label":"sport","text":"For basketball...? we do swimming workouts. We tred water in the deep end, we do sprints across the pool, and we do a lot of other things. How does that help our boies get in shape? Like.. what muscles is it working, and will it help us to loose weight?"},{"label":"sport","text":"In the Click Clack Armour Commercials, who is the guy wearing the beanie towards the end? He's not the first 'white guy' with the blonde hair... He's the one right before the last guy at the end who says 'Click Clack'... Anyone kno?"},{"label":"science","text":"where do squirels sleep and where do they go in the winter? "},{"label":"sport","text":"What is your favorite NBA team?? "},{"label":"other","text":"what is important in life good nature n charecter or good looks? "},{"label":"entertainment","text":"does anyone know what kind of music ? language are used in the Inside? man\"\" movie theme?...is it indian?...israel....."},{"label":"entertainment","text":"what song makes you cry??..? every time you hear it you cant help it but a tear comes to your eye??...."},{"label":"entertainment","text":"Does anybody know who made the old Chronicles of Narnia video with the? british kids in it and what year that was made?  I'm trying to find the soundtrack somewhere. Any good sites?"},{"label":"sport","text":"What is the black thing on the Sampdoria badge supposed to be? "},{"label":"entertainment","text":"Why Celine Dion is broadcasted on jazz radios? I just wondered why. I pretty much hate Celine Dion's music and I can't find why she should be considered as a jazz artist. Is it because she has done a cover of Etta James's \"\"At Last\"\"? But I just happened to listen some jazz radios and her songs were broadcasted :\/ Could someone explain me?\\nPS: Same thing for artists such as Elton John, Sting, Phil Collins or even New Age artists such as Yanni (yuuuuuck!) etc."},{"label":"sport","text":"is it true that kareem abdul jabbar is the best centre in the history of nba? "},{"label":"entertainment","text":"Japanese Music? What's the difference between? Daizen Shu and Zenkyoku Shu. I'm looking for a cd by Takuya Jo. A person in a store said the album name is Natsumero Daizen Shu. When I look for it on line, I think I found it but it is called Natsumero Zenkyoku Shu. I don't want to buy the wrong cd. The song I like is called Hone Made Aishite. Can some one who is familar with Japanese language and or music help me. The song is old and Takuya Jo is the original artist. I think I found it at this web site. Can anyone who knows tell me if this is what I am looking for?"},{"label":"sport","text":"why can't i get any taller? "},{"label":"entertainment","text":"Who thinks Cristiano Ronaldo is Buff?????????? "},{"label":"other","text":"what means processor stepping in AMD (e3 or e6)? "},{"label":"other","text":"are relations between American and British goverments as strong as they seem? "},{"label":"science","text":"CAN EVERYONE IN THE PHYSICS SECTION STICK TOGETHEr??? And stop just giving people the answers to their homework questions, help them get the answer on their own...don't just do their homework for them!!"},{"label":"other","text":"My(male)hb is 11.5.Iron pills cause constipation.Will injections help,if so which ones.See details below.? Injection consisting of Folic acid,cyanocobalamin and Nicotinamide.But no Iron.Pills normaly have Iron but are slow and cause constipation Please advise."},{"label":"other","text":"how do you get a girl to sgin a pre nuptial agreement without getting her mad? "},{"label":"sport","text":"who is going to win? spurs or mavs? "},{"label":"entertainment","text":"Has anyone seen the movie...? Mating Habits Of The Earthbound Human?  It is hilarious (in my opinion). If you have seen it, what did you think?"},{"label":"other","text":"how can you go on a date? see I like this guy and I would LOVE to go on a date with him...HOw?"},{"label":"other","text":"I really dont want a relationship but I do want to have intimacy with a black man.what do I do? I dont want to go to a club. Any suggestions?"},{"label":"entertainment","text":"Is it possible to have a quarter-life crisis? "},{"label":"science","text":"If you were shipwrecked on a desert island, where in the world would you like that island to be? "},{"label":"sport","text":"what do you think about match between portugal vs uk? "},{"label":"entertainment","text":"which song is better???????????????? give me novacaine or u shook me all nite long????"},{"label":"other","text":"What is testicular cancer? tell me the symptoms, what causes it, death rate , and more."},{"label":"other","text":"Where do I apply for a job at the new WalMart in Desoto Texas? Looking for a job"},{"label":"sport","text":"Does anyone know which spice girl David Beckham married? I know he married one of them but WHICH ONE?????"},{"label":"other","text":"Are you selfish ??? I have, today, realised I am, !! would like to know I not alone !"}]